{"0": "<p><b>Joy:</b> <i>(narrates:)</i> Do you ever look at someone and wonder, \"What is going on inside their head?\" Well, I know. ...Well, I know Riley's head. \n</p>", "1": "<p><i>(Fades up in a white space; in a hospital room, Mr. and Mrs. Andersen are admiring their newborn baby Riley, who wakes up and coos happily. Zoom in on Riley's head.)</i>\n</p>", "2": "<p><i>(In Riley's mind, everything is black. From out of the darkness steps a glowing figure, Joy. She comes forward and sees a blank screen above her; below her is a single button. She presses it, and it turns yellow like her. Riley is heard cooing.)</i>\n</p>", "3": "<p><i>(Zoom back from Joy to the real world, showing the baby Riley as she coos and giggles happily.)</i>\n</p>", "4": "<p><b>Joy:</b> <i>(narrates:)</i> And there she was...\n</p>", "5": "<p><i>(On the screen, Mr. and Mrs. Andersens' faces materialize into view.)</i>\n</p>", "6": "<p><b>Mrs. Andersen:</b> Hello, Riley.\n</p>", "7": "<p><b>Mr. Andersen:</b> Oh, look at you. Aren't you a little bundle of joy?\n</p>", "8": "<p><i>(A ding is heard, and a glowing yellow orb of what just happened is formed from behind the screen. Joy examines it.)</i>\n</p>", "9": "<p><b>Memory Mr. Andersen:</b> Aren't you a little bundle of joy?\n</p>", "10": "<p><i>(She puts the memory back in place and it rolls across a rack around the area, making the lights come up and revealing a red-violet space of gears, as Headquarters is starting to form. Joy is astounded; she presses the button again, and Riley coos in response. Joy beams.)</i>\n</p>", "11": "<p><b>Joy:</b> <i>(narrates:)</i> It was amazing. Just Riley and me... Forever.\n</p>", "12": "<p><i>(Riley keeps giggling and Joy smiles in reply; suddenly, Riley starts crying, which confuses her.)</i>\n</p>", "13": "<p><b>Joy:</b> <i>(narrates:)</i> Er, for thirty three seconds.\n</p>", "14": "<p><i>(Next to Joy, a droopy and gloomy blue figure, Sadness, is working the button, which turns blue in response.)</i>\n</p>", "15": "<p><b>Sadness:</b> I'm Sadness.\n</p>", "16": "<p><b>Joy:</b> Oh, hello. I... I'm Joy. So... Can I just... If you could... I just want to fix that. Thanks.\n</p>", "17": "<p><i>(The two start arguing over the button as she speaks.)</i>\n</p>", "18": "<p><b>Joy:</b> <i>(narrates:)</i> And that was just the beginning. Headquarters only got more crowded from there.\n</p>", "19": "<p><i>(Riley, now a toddler, runs through the house pulling a wagon and giggling. In her mind, in the now formed Headquarters, Fear, a jagged purple figure, comes out from behind joy. The single button is now replaced with a control console.)</i>\n</p>", "20": "<p><b>Fear:</b> Very nice. Okay, looks like you got this. Very good.\n</p>", "21": "<p><i>(The screen shows everything through Riley's eyes, as she is running.)</i>\n</p>", "22": "<p><b>Fear:</b> Whoa, sharp turn! NO, LOOK OUT! NO!\n</p>", "23": "<p><i>(He takes action; the console turns purple in response.)</i>\n</p>", "24": "<p><b>Joy:</b> <i>(narrates:)</i> That's Fear. He's really good at keeping Riley safe.\n</p>", "25": "<p><i>(Fear's actions prompt Riley to stop running and notice the plugged cable, and step over it slowly.)</i>\n</p>", "26": "<p><b>Fear:</b> <i>(voiceover)</i> Easy, easy. AGH! OH MY! Oh, we're good. We're good.\n</p>", "27": "<p><i>(In Headquarters, the memories have been nestled on a shelf off to the left; a purple memory, indicating a fearful one, rolls in to nestle against the yellow one on the right.)</i>\n</p>", "28": "<p><b>Joy:</b> Whew!\n</p>", "29": "<p><b>Sadness:</b> Good job.\n</p>", "30": "<p><b>Fear:</b> Thank you. Thank you very much.\n</p>", "31": "<p><b>Joy:</b> And we're back!\n</p>", "32": "<p><i>(She takes over, prompting Riley to resume her silliness, knocking over a lamp in the process. Mr. Andersen picks her up.)</i>\n</p>", "33": "<p><b>Young Riley:</b> Oh!\n</p>", "34": "<p><i>(She is put in her high chair for lunch; she is served a bowl full of broccoli as Mr. Andersen tries to feed her a stalk.)</i>\n</p>", "35": "<p><b>Mr. Andersen:</b> Here we go. All right, open.\n</p>", "36": "<p><b>Joy:</b> Hmm. This looks new.\n</p>", "37": "<p><b>Fear:</b> You think it's safe?\n</p>", "38": "<p><b>Sadness:</b> What is it?\n</p>", "39": "<p><i>(On the screen, Mr. Andersen brings the spoonful forward.</i> <i>Here comes a green feminine figure, Disgust, who takes control.)</i>\n</p>", "40": "<p><b>Disgust:</b> Okay, caution! There is a dangerous smell, people! Hold on. What is that?\n</p>", "41": "<p><b>Joy:</b> <i>(narrates:)</i> This is Disgust. She basically keeps Riley from being poisoned. Physically and socially.\n</p>", "42": "<p><b>Disgust:</b> That is not brightly colored or shaped like a dinosaur. Hold on, guys. It's <i>broccoli!</i>\n</p>", "43": "<p><i>(She retches and works the console, turning it green; this prompts Riley to react.)</i>\n</p>", "44": "<p><b>Young Riley:</b> YUCKY!\n</p>", "45": "<p><i>(She flips her bowl, spilling the broccoli into Mr. Andersen's face. On the memory shelf, a green memory rolls in, indicating a disgusted one.)</i>\n</p>", "46": "<p><b>Disgust:</b> Well, I just saved our lives.\n</p>", "47": "<p><b>Fear and Sadness:</b> Whew!\n</p>", "48": "<p><b>Disgust:</b> Yeah. You're welcome.\n</p>", "49": "<p><b>Mr. Andersen:</b> Riley, if you don't eat your dinner, you're not gonna get any dessert.\n</p>", "50": "<p><i>(Shifts to a red firebrick-like figure, Anger, who sits and reads a newspaper with a headline \"NO DESSERT!\"; he puts it down lividly.)</i>\n</p>", "51": "<p><b>Anger:</b> Wait. Did he just say we couldn't have dessert?\n</p>", "52": "<p><i>(He puts down the newspaper and steps up to the console; his head begins to flame up.)</i>\n</p>", "53": "<p><b>Joy:</b> <i>(narrates:)</i> That's Anger. He cares very deeply about things being fair.\n</p>", "54": "<p><b>Anger:</b> So that's how you want to play it, old man?! No dessert?! Oh, sure, we'll eat our dinner! Right after YOU eat THIS!\n</p>", "55": "<p><i>(The console turns red as he mans it, and, letting out a furious yell, does his thing as a heavy drumroll is heard in the background score. This prompts Riley to scream in her chair as well, and a red angry memory rolls in on the shelf. She keeps throwing a fit when Mr. Andersen intervenes.)</i>\n</p>", "56": "<p><b>Mr. Andersen:</b> Riley, Riley, here comes an airplane!\n</p>", "57": "<p><i>(He makes the sound of an airplane flying; Anger immediately calms down.)</i>\n</p>", "58": "<p><b>Anger:</b> Oh, airplane. We got an airplane, everybody.\n</p>", "59": "<p><b>Joy, Sadness, Disgust:</b> Oh!\n</p>", "60": "<p><b>Fear:</b> Airplane.\n</p>", "61": "<p><i>(Mr. Andersen successfully feeds Riley, who has also calmed down; a yellow memory appears on the shelf. Sadness then lounges next to Joy, who is obviously not pleased by her presence.)</i>\n</p>", "62": "<p><b>Joy:</b> <i>(narrates:)</i> And you've met Sadness. She... Well, she...  I'm not actually sure what she does.\n</p>", "63": "<p><i>(She smiles meekly at Sadness, who promptly exits.)</i>\n</p>", "64": "<p><b>Joy:</b> <i>(narrates:)</i> And I've checked, there's no place for her to go, so... She's good, we're good. It's all great!\n</p>", "65": "<p><i>(She goes over to the left side of Headquarters, shelves lined with various memory orbs. Most of them are happy and yellow.)</i>\n</p>", "66": "<p><b>Joy:</b> <i>(narrates:)</i> Anyway, these are Riley's Memories, and they're mostly happy, you'll notice. Not to brag.\n</p>", "67": "<p><i>(She inspects one memory of Riley and her friend Meg playing on a playground slide.</i> <i>She rewinds the memory like a touchscreen with her finger.</i> <i>She hugs the memory and puts it back; she then goes over to the center of the room to a big round setting of five round lights shooting out beams to the windows outside.)</i>\n</p>", "68": "<p><b>Joy:</b> <i>(narrates:)</i> But the really important ones are over here.\n</p>", "69": "<p><i>(She pushes down a slot; this brings up a pedestal of five dazzlingly bright memory orbs arranged in a circle.)</i>\n</p>", "70": "<p><b>Joy:</b> <i>(narrates:)</i> I don't want to get too technical, but these are called Core Memories. Each one came from a super important time in Riley's life. Uh, like when she first scored a goal?\n</p>", "71": "<p><i>(Flashback to Riley and her parents ice skating on the lake, playing pretend hockey.)</i>\n</p>", "72": "<p><b>Joy:</b> <i>(narrates:)</i> Oh, that was so amazing!\n</p>", "73": "<p><i>(A stumble, she unknowingly hits the puck and scores a goal.)</i>\n</p>", "74": "<p><b>Mr. Andersen:</b> Hey! Would you look at that? Very nice! We got a future center here!\n</p>", "75": "<p><b>Mrs. Andersen:</b> Nice job!\n</p>", "76": "<p><i>(In Headquarters, the emotions cheer in response. Suddenly, a loud ding and bright light catches them off guard. From behind the screen is a brightly glowing orb of the memory, which slips into the floor and slides through an underground track to the pedestal, which shoots out a beam of light and creates a floating island outside decorated with various hockey equipment.)</i>\n</p>", "77": "<p><b>Joy:</b> <i>(narrates:)</i> And each Core Memory powers a different aspect of Riley's personality. Like... Hockey Island!\n</p>", "78": "<p><i>(The emotions go to observe the five islands outside, with the hockey one in the middle. To the far left is an island of various toys and silly things, and a big clown's face.)</i>\n</p>", "79": "<p><b>Joy:</b> <i>(narrates:)</i> Goofball Island is my personal favorite.\n</p>", "80": "<p><i>(Flashback: Riley runs through the house naked as her parents chase her.)</i>\n</p>", "81": "<p><b>Mr. Andersen:</b> Ah, come back here, you little monkey!\n</p>", "82": "<p><i>(This act of silliness is what sets the island in action, showing the clown's eyes spin around and its tongue sticking out, a mallet hitting its head, and a series of practical jokes like a Ferris wheel of shoes honking a horn and a monkey centerpiece spinning plates.)</i>\n</p>", "83": "<p><b>Mr. Andersen:</b> <i>(laughs)</i> Oh, you're silly!\n</p>", "84": "<p><b>Joy:</b> <i>(narrates:)</i> Yep, Goofball is the best.\n</p>", "85": "<p><i>(Just to the left is an island showing two heads of people talking to each other among with various \"friendly\" material, like hearts, stars, and statuettes of people dancing.)</i>\n</p>", "86": "<p><b>Joy:</b> <i>(narrates:)</i> Friendship Island is pretty good too.\n</p>", "87": "<p><i>(Flashback: Riley and Meg walking arm-in-arm, leg-over-leg, down the sidewalk. To the left of Hockey Island is an island with various integrity memorabilia, such as scales, gavels, and a courthouse on a hill.)</i>\n</p>", "88": "<p><b>Joy:</b> <i>(narrates:)</i> Oh, I love Honesty Island. And that's the truth!\n</p>", "89": "<p><i>(Flashback: A guilty Riley stands near a broken plate and holds up a hammer admitting she was behind it. The last island to the far right features various family-oriented landmarks, such as a family tree, a board game, the Andersens' car hauling a trailer, three figures jumping on a trampoline, and a trio of gigantic statues representing the Andersens in a warm embrace.)</i>\n</p>", "90": "<p><b>Joy:</b> <i>(narrates:)</i> And of course, Family Island is amazing!\n</p>", "91": "<p><i>(Flashback: Riley and her parents decorate cookies together. Riley stuffs her cookie in Mr. Andersens' mouth.)</i>\n</p>", "92": "<p><b>Joy:</b> <i>(narrates:)</i> The point is, the Islands of Personality are what make Riley... Riley!\n</p>", "93": "<p><i>(Quick intercuts: Riley in the bath.)</i>\n</p>", "94": "<p><b>Young Riley:</b> Look out, mermaid!\n</p>", "95": "<p><i>(She makes a big splash; Riley is now in the living room crawling across the couch. In Headquarters, Joy inserts a flower chip into the console which projects a daydream from Riley's view; the floor becoming imaginary lava.)</i>\n</p>", "96": "<p><b>Young Riley:</b> Lava! Whee!\n</p>", "97": "<p><i>(She jumps to the chair: Now she sits and draws a doodle of a pink elephant creature on the living room wall.)</i>\n</p>", "98": "<p><b>Young Riley:</b> ♪ Who's your friend who likes to play? Bing Bong, Bing Bong! ♪\n</p>", "99": "<p><i>(On a frozen pond, the six-year-old Riley skates for her parents.)</i>\n</p>", "100": "<p><b>Mr. Andersen:</b> Hey! Very nice!\n</p>", "101": "<p><b>Mrs. Andersen:</b> Where'd you learn that?\n</p>", "102": "<p><i>(In Headquarters, Joy \"skates\" around the floor. On the front doorstep, the 11-year-old Riley and Meg drink Slushees; suddenly, Riley gets a brain freeze from drinking too fast.)</i>\n</p>", "103": "<p><b>Riley:</b> Ahhh!!!\n</p>", "104": "<p><i>(In Headquarters, everything and everyone begins to ice over.)</i>\n</p>", "105": "<p><b>Fear:</b> BRAIN FREEZE!!!\n</p>", "106": "<p><i>(The emotions scream as they succumb to the freezing; first Anger, then Fear, and finally Sadness, whose eyes remain the only part active once immobile. On the ice pond, Riley is now participating in a hockey game; she successfully scores as the crowd cheers.)</i>\n</p>", "107": "<p><b>Riley:</b> Yeah!\n</p>", "108": "<p><b>Joy:</b> Yay!\n</p>", "109": "<p><i>(Riley is now tucked in bed; Mr. Andersen clicks off the light.)</i>\n</p>", "110": "<p><b>Mr. Andersen:</b> Good night, kiddo.\n</p>", "111": "<p><b>Riley:</b> Good night, Dad.\n</p>", "112": "<p><i>(The door closes; Riley looks at the glow-in-the-dark stars on her bedroom ceiling as Joy watches. The screen dims out like a TV switching off as Riley falls asleep.)</i>\n</p>", "113": "<p><b>Joy:</b> And... we're out. <i>(she goes to examine all the memories on the shelves)</i> That's what I'm talking about! Whoo! Another perfect day! Nice job, everybody! Let's get those memories down to Long Term.\n</p>", "114": "<p><i>(Joy presses a button on the floor with her foot; the memories begin to slide off the shelves and across roof trails.)</i>\n</p>", "115": "<p><b>Fear:</b> All right, we did not die today! I call that an unqualified success.\n</p>", "116": "<p><i>(Disgust observes as the memories continue to pachinko and flush out, then sink into the floor through the underground trails as the recall tube in the roof covers the hole in the floor and sucks the memories up right through it. Joy goes to the window and watches the memories rain down across Long Term Memory like falling stars.)</i>\n</p>", "117": "<p><b>Joy:</b> <i>(narrates:)</i> And that's it. We love our girl. She's got great friends and a great house. Things couldn't be better. After all, Riley's 11 now. What could happen?\n</p>", "118": "<p><i>(Outside the Andersen house, a \"For Sale\" sign is placed into the ground; across the middle reads \"SOLD\".)</i>\n</p>", "119": "<p><b>Joy:</b> What...?\n</p>", "120": "<p><b>Sadness, Anger, Fear, Disgust:</b> AAUGH!!!\n</p>", "121": "<p><i>(Mr. Andersen closes the trunk of the car.)</i>\n</p>", "122": "<p><b>Sadness, Anger, Fear, Disgust:</b> AAUGH!!!\n</p>", "123": "<p><i>(A moving van drives off.)</i>\n</p>", "124": "<p><b>Joy:</b> Okay, not what I had in mind.\n</p>", "125": "<p><b>Sadness, Anger, Fear, Disgust:</b> AAUGH!!!\n</p>", "126": "<p>The car drives across the bridge. Riley looks out the window.\n</p>", "127": "<p>JOY (V.O.) Hey look! The Golden Gate Bridge! Isn’t that great?! It’s not made out of solid gold like we thought, which is kind of a disappointment, but still!\n</p>", "128": "<p>The car drives past the Ferry Building.\n</p>", "129": "<p>INT. HEADQUARTERS\n</p>", "130": "<p>FEAR\n</p>", "131": "<p>I sure am glad you told me earthquakes are a myth, Joy. Otherwise I’d be terrified right now!\n</p>", "132": "<p>Everyone eyes each other behind Fear’s back.\n</p>", "133": "<p>JOY Uh... yeah.\n</p>", "134": "<p>EXT. LOMBARD STREET - DAY\n</p>", "135": "<p>The car is stuck in traffic. Cars HONK and people YELL.\n</p>", "136": "<p>INT. HEADQUARTERS\n</p>", "137": "<p>ANGER These are my kind of people!\n</p>", "138": "<p>EXT. MARKET STREET - DAY\n</p>", "139": "<p>DAD All right, just a few more blocks. We’re almost to our new house!\n</p>", "140": "<p>INT. HEADQUARTERS\n</p>", "141": "<p>ANGER Step on it, Daddy!\n</p>", "142": "<p>DISGUST Why don't we just live in this smelly car? We've already been in it forever.\n</p>", "143": "<p>JOY\n</p>", "144": "<p>Which, actually, was really lucky, because that gave us plenty of time to think about what our new house is going to look like! Let’s review the top five daydreams.\n</p>", "145": "<p>Joy plugs in DAYDREAMS showing fantasy houses: tree house, water-slide house, etc.\n</p>", "146": "<p>FEAR Ooh! That looks safe!\n</p>", "147": "<p>JOY Ohh, this is will be great for Riley! Oh, no, no, no, THIS one. A gingerbread house.\n</p>", "148": "<p>DISGUST (O.S.) Ugh, Joy. For the last time, she cannot live in a cookie. A castle. \n</p>", "149": "<p>ANGER THAT’S the one! It comes with a dragon!\n</p>", "150": "<p>EXT. SAN FRANCISCO HOUSE - DAY\n</p>", "151": "<p>JOY (O.S.) Now we’re getting close, I can feel it. Here it is, here’s our new house... and...\n</p>", "152": "<p>The car stops and Riley steps out.\n</p>", "153": "<p>REVEAL: a run-down Victorian. Nothing like the daydreams.\n</p>", "154": "<p>INT. HEADQUARTERS\n</p>", "155": "<p>Everyone looks slackjawed.\n</p>", "156": "<p>JOY Maybe it’s nice on the inside.\n</p>", "157": "<p>INT. SAN FRANCISCO HOUSE - CONTINUOUS\n</p>", "158": "<p>Riley steps inside. The room is dark, dusty, uninviting.\n</p>", "159": "<p>ANGER (V.O.) We’re supposed to live here?\n</p>", "160": "<p>SADNESS (V.O.) Do we have to?\n</p>", "161": "<p>DISGUST (V.O.) I’m telling you, it smells like something died in here.\n</p>", "162": "<p>INT. HEADQUARTERS\n</p>", "163": "<p>A disgust memory rolls in.\n</p>", "164": "<p>FEAR Can you die from moving?\n</p>", "165": "<p>JOY Guys, you’re overreacting. Nobody is dying--\n</p>", "166": "<p>DISGUST A DEAD MOUSE!!!\n</p>", "167": "<p>ON THE SCREEN: A dead mouse in the corner.\n</p>", "168": "<p>DISGUST (O.S.) (CONT’D) I’m gonna be sick...\n</p>", "169": "<p>ANGER (O.S.) Great, this is just great.\n</p>", "170": "<p>FEAR (O.S.) Ahhhhh!! It’s the house of the dead! What are we gonna do?! We’re gonna get rabies!!!\n</p>", "171": "<p>Fear jumps into Anger’s arms. Anger fires up the flames.\n</p>", "172": "<p>ANGER GET OFFA ME!!!\n</p>", "173": "<p>Fear runs around on fire. Joy puts him out with a fire extinguisher.\n</p>", "174": "<p>JOY Hey, hey, hey, all through the drive Dad talked about how cool our new room is. Let’s go check it out!\n</p>", "175": "<p>FEAR/ANGER/DISGUST (O.S.) You’re right, Joy/Yeah!/That’s right!/Yes, yes, yes!\n</p>", "176": "<p>INT. SAN FRANCISCO HOUSE\n</p>", "177": "<p>Riley dashes up the stairs.\n</p>", "178": "<p>INT. RILEY’S ROOM - CONTINUOUS\n</p>", "179": "<p>It’s tiny. Depressing.\n</p>", "180": "<p>FEAR/DISGUST/ANGER (O.S.) No, no, no, no, no./I’m starting to envy the dead mouse./Get out the rubber ball, we’re in solitary confinement.\n</p>", "181": "<p>INT. HEADQUARTERS\n</p>", "182": "<p>SADNESS Oh, Riley can’t live here.\n</p>", "183": "<p>ANGER She's right.\n</p>", "184": "<p>FEAR Really bad.\n</p>", "185": "<p>DISGUST It’s the worst. It’s absolutely the worst.\n</p>", "186": "<p>ANGER This house stinks.\n</p>", "187": "<p>Memories roll in: anger, disgust, fear.\n</p>", "188": "<p>JOY Hey, it’s nothing our butterfly curtains couldn’t fix. I read somewhere that an empty room is an opportunity.\n</p>", "189": "<p>ANGER Where did you read that?\n</p>", "190": "<p>Joy:  It doesn’t matter. I read it and it’s great. We’ll put the bed there. And the desk over there... \n</p>", "191": "<p>Joy projects an IMAGINATION of Riley’s furniture.\n</p>", "192": "<p>FEAR The hockey lamp goes there...\n</p>", "193": "<p>ANGER Put the chair there.\n</p>", "194": "<p>DISGUST Well, the trophy collection goes there.\n</p>", "195": "<p>SADNESS Posters...\n</p>", "196": "<p>FEAR Stars! I like that.\n</p>", "197": "<p>JOY Now we’re talking! Let’s go get our stuff from the moving van!\n</p>", "198": "<p>INT. SAN FRANCISCO HOUSE - DAY\n</p>", "199": "<p>Riley dashes down the stairs as Mom and Dad enter the house. Dad is on the phone.\n</p>", "200": "<p>DAD Alright. Goodbye. (hangs up; to Mom) Well, guess what? The moving van won’t be here until Thursday. \n</p>", "201": "<p>MOM You’re kidding.\n</p>", "202": "<p>INT. HEADQUARTERS\n</p>", "203": "<p>FEAR The van is lost?! This is the worst day ever!\n</p>", "204": "<p>ON THE SCREEN: Mom and Dad ARGUE.\n</p>", "205": "<p>MOM You said it would be here yesterday!\n</p>", "206": "<p>DAD I know that’s what I said. * That’s what they told me!\n</p>", "207": "<p>FEAR (O.S.) Mom and Dad are stressed out!\n</p>", "208": "<p>FEAR/ANGER/DISGUST/SADNESS They’re arguing!/What are we going to do?/This is so stressful./What is their problem?\n</p>", "209": "<p>Joy runs to storage and grabs what looks to be a LIGHTBULB.\n</p>", "210": "<p>JOY I’ve got a great idea!\n</p>", "211": "<p>She clicks the IDEA into the console.\n</p>", "212": "<p>INT. SAN FRANCISCO LIVING ROOM - DAY\n</p>", "213": "<p>Riley’s face lights up. Riley grabs her hockey stick. Puts a wad of paper in play.\n</p>", "214": "<p>MOM Did you even read the contract?\n</p>", "215": "<p>DAD Honey, you act like this is my fault-- * \n</p>", "216": "<p>RILEY Andersen makes her move. She's closing in!\n</p>", "217": "<p>DAD (grabbing a broom) Hey! Oh, no you’re not!\n</p>", "218": "<p>RILEY She’s lining up for the shot!\n</p>", "219": "<p>DAD Coming behind you! Watch out!\n</p>", "220": "<p>She slides past him. Knocks the “puck” into the fireplace.\n</p>", "221": "<p>RILEY She shoots and she scores! Yeah!\n</p>", "222": "<p>INT. HEADQUARTERS\n</p>", "223": "<p>The Emotions cheer. Out the back window, Family Island runs.\n</p>", "224": "<p>INT. SAN FRANCISCO LIVING ROOM - CONTINUOUS\n</p>", "225": "<p>RILEY (taunting Mom) Come on, Grandma!\n</p>", "226": "<p>MOM Ha! “Grandma?”\n</p>", "227": "<p>INT. HEADQUARTERS\n</p>", "228": "<p>JOY Uh-oh, she put her hair up, we’re in for it!\n</p>", "229": "<p>INT. SAN FRANCISCO LIVING ROOM\n</p>", "230": "<p>They all play hockey, Mom using a pillow to guard the “goal.”\n</p>", "231": "<p>Dad picks her up to shoot past her.\n</p>", "232": "<p>MOM (laughing) Woo! Hey, put me down!\n</p>", "233": "<p>Dad scoops up Riley, too. Riley giggles.\n</p>", "234": "<p>INT. HEADQUARTERS\n</p>", "235": "<p>A happy memory rolls in. Joy’s back in charge.\n</p>", "236": "<p>INT. SAN FRANCISCO LIVING ROOM\n</p>", "237": "<p>Dad’s cell phone beeps.\n</p>", "238": "<p>DAD Ugh. Sorry, hold on, hold on. (answers) Hello?\n</p>", "239": "<p>INT. HEADQUARTERS\n</p>", "240": "<p>JOY Wait. Wha--?\n</p>", "241": "<p>INT. SAN FRANCISCO LIVING ROOM\n</p>", "242": "<p>DAD You’re kidding. All right. Stall for me, I’ll be right there. (hangs up) The investor’s supposed to show up on Thursday, not today! I gotta go.\n</p>", "243": "<p>INT. HEADQUARTERS\n</p>", "244": "<p>Joy is disappointed.\n</p>", "245": "<p>INT. SAN FRANCISCO LIVING ROOM\n</p>", "246": "<p>MOM It's okay. We get it.\n</p>", "247": "<p>DAD You’re the best. Thanks, Hon. (to Riley, as he leaves) See you, Sweetie.\n</p>", "248": "<p>INT. HEADQUARTERS\n</p>", "249": "<p>FEAR Dad just left us.\n</p>", "250": "<p>SADNESS Oh, he doesn’t love us anymore. That’s sad. I should drive, right?\n</p>", "251": "<p>JOY BLOCKS HER.\n</p>", "252": "<p>SADNESS (CONT’D) Joy? What are you doing?\n</p>", "253": "<p>JOY Uh, just uh, gimme one second... You know what I’ve realized? Riley hasn’t had lunch!\n</p>", "254": "<p>(takes a memory off the wall and plays it)\n</p>", "255": "<p>Remember?\n</p>", "256": "<p>MEMORY: A PIZZA SHOP.\n</p>", "257": "<p>INT. SAN FRANCISCO LIVING ROOM\n</p>", "258": "<p>RILEY Hey I saw a pizza place down the street. Maybe we could try that?\n</p>", "259": "<p>MOM Pizza sounds delicious!\n</p>", "260": "<p>INT. HEADQUARTERS\n</p>", "261": "<p>FEAR/ANGER/DISGUST Yeah!/Pizza!/Good idea, Joy.\n</p>", "262": "<p>Joy smiles.\n</p>", "263": "<p>INT. PIZZA PLACE - DAY\n</p>", "264": "<p>Riley and Mom get their pizza. On it: broccoli.\n</p>", "265": "<p>INT. HEADQUARTERS\n</p>", "266": "<p>FEAR/JOY/DISGUST What the HECK IS THAT?!/Who puts broccoli on pizza?/That’s it. I’m done.\n</p>", "267": "<p>ANGER Congratulations, San Francisco, you’ve ruined pizza! First the Hawaiians, and now YOU!\n</p>", "268": "<p>EXT. SAN FRANCISCO STREET - LATER\n</p>", "269": "<p>Mom and Riley walk home. Riley looks disappointed.\n</p>", "270": "<p>MOM What kind of a pizza place only serves one kind of pizza? Must be a San Francisco thing, huh?\n</p>", "271": "<p>INT. HEADQUARTERS\n</p>", "272": "<p>Joy glances at the wall of multi-colored memories. She sighs: things are not going well.\n</p>", "273": "<p>EXT. SAN FRANCISCO STREET - CONTINUOUS\n</p>", "274": "<p>MOM Still, it’s not as bad as the soup at that diner in Nebraska.\n</p>", "275": "<p>RILEY Oh yeah. The spoon stood up in the soup by itself! That was disgusting.\n</p>", "276": "<p>INT. HEADQUARTERS\n</p>", "277": "<p>Joy looks out the back window. Family Island is going.\n</p>", "278": "<p>JOY Oh good. Family is running. \n</p>", "279": "<p>EXT. SAN FRANCISCO STREET\n</p>", "280": "<p>MOM The drive out was pretty fun, huh? What was your favorite part?\n</p>", "281": "<p>INT. HEADQUARTERS\n</p>", "282": "<p>ANGER Spitting out the car window!\n</p>", "283": "<p>DISGUST Definitely not when Dad was singing.\n</p>", "284": "<p>FEAR Wearing a seat belt!\n</p>", "285": "<p>JOY What about the time with the dinosaur!\n</p>", "286": "<p>Joy pulls up a memory.\n</p>", "287": "<p>SADNESS/FEAR/ANGER/DISGUST Yeah./Yup./That’s the one.\n</p>", "288": "<p>ON THE SCREEN: Riley and Mom pose in front of a roadside cement dinosaur in Vernal, Utah.\n</p>", "289": "<p>DAD (ON SCREEN) Say cheese!\n</p>", "290": "<p>Behind Dad, the car rolls down the hill. No brakes!\n</p>", "291": "<p>RILEY (ON SCREEN) Dad! Dad! Look behind you.\n</p>", "292": "<p>MOM (ON SCREEN) Honey. The car! The car!\n</p>", "293": "<p>DAD (ON SCREEN) Hold still. Huh? (runs off after the car) Stoooop! No no no nononono!!\n</p>", "294": "<p>Stegosaurus tail through the back window. The family laughs.\n</p>", "295": "<p>Enjoying the memory, Joy and the others chuckle.\n</p>", "296": "<p>FEAR Nice one, Joy.\n</p>", "297": "<p>EXT. SAN FRANCISCO STREET\n</p>", "298": "<p>RILEY (smiling) I liked that time at the dinosaur. That was pretty funny.\n</p>", "299": "<p>INT. HEADQUARTERS\n</p>", "300": "<p>Joy’s cheer is cut short when the dinosaur memory TURNS BLUE.\n</p>", "301": "<p>EXT. SAN FRANCISCO STREET - DAY\n</p>", "302": "<p>Riley’s smile fades.\n</p>", "303": "<p>INT. HEADQUARTERS\n</p>", "304": "<p>JOY: Wait. What? What happened?\n</p>", "305": "<p>Joy looks back. Sadness is touching the memory.\n</p>", "306": "<p>FEAR She did something to the memory.\n</p>", "307": "<p>Joy tries to fix the memory.\n</p>", "308": "<p>JOY What did you do?\n</p>", "309": "<p>SADNESS I just touched it.\n</p>", "310": "<p>JOY That shouldn’t make it change.\n</p>", "311": "<p>FEAR Change it back, Joy!\n</p>", "312": "<p>Joy rubs it, but the memory stays blue.\n</p>", "313": "<p>JOY: I’m trying.\n</p>", "314": "<p>ANGER: You can’t change it back?\n</p>", "315": "<p>JOY: No, I guess I can’t!\n</p>", "316": "<p>DISGUST: Good going Sadness. Now when Riley thinks of that moment with Dad, she’s gonna feel sad. Bravo.\n</p>", "317": "<p>SADNESS I’m sorry Joy... I don’t really know-- I thought maybe, if you-- if I-- if... I mean...\n</p>", "318": "<p>DISGUST Joy, we've got a stairway coming up.\n</p>", "319": "<p>EXT. SAN FRANCISCO STREET - DAY\n</p>", "320": "<p>Riley runs towards a stairway and handrail.\n</p>", "321": "<p>INT. HEADQUARTERS\n</p>", "322": "<p>JOY Just don’t touch any other memories until we figure out what’s going on.\n</p>", "323": "<p>SADNESS Okay.\n</p>", "324": "<p>JOY (stepping up to controls) Alright. Get ready, this is a monster railing, and we are riding it all the way down!\n</p>", "325": "<p>EXT. SAN FRANCISCO STREET - CONTINUOUS\n</p>", "326": "<p>Riley sits on the railing, ready to slide.\n</p>", "327": "<p>INT. HEADQUARTERS\n</p>", "328": "<p>Joy looks back: GOOFBALL ISLAND is whirring like crazy.\n</p>", "329": "<p>EXT. SAN FRANCISCO STREET\n</p>", "330": "<p>Riley goes to slide... but hops off and walks down instead.\n</p>", "331": "<p>INT. HEADQUARTERS\n</p>", "332": "<p>JOY Wait, what? What happened?\n</p>", "333": "<p>Suddenly a CORE MEMORY ROLLS up to Joy’s feet.\n</p>", "334": "<p>FEAR A core memory!\n</p>", "335": "<p>JOY Oh no!\n</p>", "336": "<p>Out the back window, GOOFBALL ISLAND GOES DARK. Joy rushes to the Core Memory Holder.\n</p>", "337": "<p>JOY (CONT’D) Sadness! What are you doing?\n</p>", "338": "<p>SADNESS It looked like one was crooked so I opened it and then it fell out!\n</p>", "339": "<p>Joy pops the memory back in. GOOFBALL ISLAND comes back on.\n</p>", "340": "<p>EXT. SAN FRANCISCO STREET\n</p>", "341": "<p>Riley jumps back on the railing and slides down.\n</p>", "342": "<p>RILEY Woo hoo!\n</p>", "343": "<p>INT. HEADQUARTERS\n</p>", "344": "<p>SADNESS It’s just that... I wanted to maybe hold one.\n</p>", "345": "<p>She reaches out to touch one, AND IT STARTS TO GO BLUE.\n</p>", "346": "<p>FEAR JOY!\n</p>", "347": "<p>Joy pushes Sadness away before she can touch it.\n</p>", "348": "<p>JOY Whoa, whoa, whoa!\n</p>", "349": "<p>The core memory TURNS BACK TO YELLOW.\n</p>", "350": "<p>JOY (CONT’D) Sadness! You nearly touched a core memory. And when you touch them, we can’t change them back!\n</p>", "351": "<p>SADNESS I know. I’m sorry. Something’s wrong with me. It’s like I’m having a breakdown.\n</p>", "352": "<p>JOY You are not having a breakdown. It’s stress.\n</p>", "353": "<p>SADNESS I keep making mistakes like that. I’m awful...\n</p>", "354": "<p>JOY Nooo, you’re not.\n</p>", "355": "<p>SADNESS ...and annoying.\n</p>", "356": "<p>JOY Well... uh... You know what? You can’t focus on what’s going wrong. There’s always a way to turn things around, to find the fun!\n</p>", "357": "<p>SADNESS Yeah. Find the fun. I don’t know how to do that.\n</p>", "358": "<p>JOY Okay. Well, try think of something funny! \n</p>", "359": "<p>Long pause.\n</p>", "360": "<p>SADNESS Oh! Remember the funny movie where the dog dies?\n</p>", "361": "<p>JOY Yeah, that’s not... (tries another approach) What about that time with Meg, when Riley laughed so hard milk came out of her nose? I mean come on...\n</p>", "362": "<p>INSERT: Riley spitting milk out of her nose, Meg laughing.\n</p>", "363": "<p>SADNESS Yeah, that hurt. It felt like fire.\n</p>", "364": "<p>JOY Okay, okay, don’t think of that. Let’s try something else. What are your favorite things to do?\n</p>", "365": "<p>SADNESS My favorite? Um, well, I like it when we’re outside.\n</p>", "366": "<p>JOY That’s good! Like there’s the beach and sunshine... Oh! Like that time we buried Dad in the sand up to his neck?\n</p>", "367": "<p>INSERT: Riley at beach, Dad buried in sand.\n</p>", "368": "<p>SADNESS (V.O.) I was thinking more like rain.\n</p>", "369": "<p>INSERT: Riley stands in a downpour.\n</p>", "370": "<p>JOY Rain? Rain... is my favorite too!\n</p>", "371": "<p>We can stomp around in puddles...\n</p>", "372": "<p>INSERT: Riley happily jumps through puddles.\n</p>", "373": "<p>JOY (CONT’D) There’s cool umbrellas, lightning storms...\n</p>", "374": "<p>SADNESS (V.O.) More like when the rain runs down our back and makes our shoes soggy. And we get all cold and shivery...\n</p>", "375": "<p>INSERT: Riley’s shoes fill with water. She looks miserable.\n</p>", "376": "<p>SADNESS ...and everything just starts feeling droopy...\n</p>", "377": "<p>Sadness melts to the floor, crying.\n</p>", "378": "<p>JOY Oh, hey, hey... easy. Why are you crying? That’s really the opposite of what we’re going for here.\n</p>", "379": "<p>SADNESS Crying helps me slow down and obsess over the weight of life's problems.\n</p>", "380": "<p>JOY Ugh, you know what? Let’s think about something else. How about we read some mind manuals, huh? Sounds fun!\n</p>", "381": "<p>She drags Sadness over to a shelf of technical manuals.\n</p>", "382": "<p>SADNESS I’ve read most of them.\n</p>", "383": "<p>JOY Well have you read this one? This seems interesting: “Long-Term Memory Retrieval, Volume 47?”\n</p>", "384": "<p>SADNESS No.\n</p>", "385": "<p>JOY Ohhh! A real page turner!\n</p>", "386": "<p>SADNESS (opens manual; reads) “Long-Term Memory Data Selection via channel sub-grouping?”\n</p>", "387": "<p>JOY See? Fun already! You lucky dog, you’re reading these cool things and I gotta go work. Life is so unfair.\n</p>", "388": "<p>Joy walks away. But just as she thinks things are handled...\n</p>", "389": "<p>DING! Another memory -- Disgust -- slides in. Joy groans.\n</p>", "390": "<p>INT. SAN FRANCISCO HOUSE - NIGHT\n</p>", "391": "<p>Riley hops down the stairs towards the living room.\n</p>", "392": "<p>DAD (O.S.) (on phone) What can we do? We’ve only got capital to last a month, maybe two. If we can't find investors by then, we’re going to have to lay people off.\n</p>", "393": "<p>Riley hears the stress in Dad’s voice.\n</p>", "394": "<p>RILEY Mom! Dad! Come kiss me g’night!\n</p>", "395": "<p>MOM Be right there!\n</p>", "396": "<p>DAD (on phone) I know, I know! We’ve got to land this, okay?\n</p>", "397": "<p>Riley heads back upstairs.\n</p>", "398": "<p>INT. RILEY’S ROOM - MOMENTS LATER\n</p>", "399": "<p>Riley climbs into her sleeping bag.\n</p>", "400": "<p>INT. HEADQUARTERS\n</p>", "401": "<p>FEAR Did you hear Dad? He sounded really upset.\n</p>", "402": "<p>INT. RILEY’S ROOM\n</p>", "403": "<p>STRANGE NOISES from outside. Headlights cast shadows on the wall. Riley looks scared.\n</p>", "404": "<p>INT. HEADQUARTERS\n</p>", "405": "<p>FEAR What was that? Was it a bear? It’s a bear!\n</p>", "406": "<p>DISGUST There are no bears in San Francisco!\n</p>", "407": "<p>ANGER I saw a really hairy guy. He looked like a bear.\n</p>", "408": "<p>FEAR Oh, I’m so jumpy, my nerves are shot!\n</p>", "409": "<p>DISGUST Ew, I don’t want to hear about your nerves!\n</p>", "410": "<p>ANGER I’ll tell you what it is. This move has been a bust.\n</p>", "411": "<p>FEAR That’s what I’ve been telling you guys! There are at least 37 things for Riley to be scared of right now!\n</p>", "412": "<p>DISGUST The smell alone is enough to make her gag.\n</p>", "413": "<p>ANGER I can’t believe Mom and Dad moved us here!\n</p>", "414": "<p>JOY Look, I get it. You guys have concerns. But we’ve been through worse! Tell you what: let’s make a list of all the things Riley should be HAPPY about!\n</p>", "415": "<p>ANGER Fine. Let’s see... this house stinks, our room stinks...\n</p>", "416": "<p>DISGUST Pizza is weird here...\n</p>", "417": "<p>SADNESS Our friends are back home...\n</p>", "418": "<p>FEAR And all of our stuff is in the missing van!\n</p>", "419": "<p>JOY Oh c’mon, it could be worse...\n</p>", "420": "<p>DISGUST Yeah, Joy. We could be lying on the dirty floor. In a bag.\n</p>", "421": "<p>INT. RILEY’S ROOM\n</p>", "422": "<p>Riley is lying on the dirty floor in a sleeping bag.\n</p>", "423": "<p>INT. HEADQUARTERS\n</p>", "424": "<p>JOY Okay, I admit it, we had a rough start. But think of all the good things that--\n</p>", "425": "<p>ANGER No, Joy. There’s absolutely no reason for Riley to be happy right now. Let us handle this.\n</p>", "426": "<p>FEAR I say we skip school tomorrow and lock ourselves in the bedroom.\n</p>", "427": "<p>DISGUST We have no clean clothes. I mean, no one should see us.\n</p>", "428": "<p>SADNESS Yeah, we could cry until we can’t breathe.\n</p>", "429": "<p>ANGER We should lock the door and scream that curse word we know. It’s a good one!\n</p>", "430": "<p>JOY Now hold on! Look, we all have our off days. You know, I--\n</p>", "431": "<p>ON THE SCREEN: Mom opens Riley’s bedroom door.\n</p>", "432": "<p>MOM Hi honey.\n</p>", "433": "<p>ANGER The Mom Bad News Train is pulling in! Toot toot!\n</p>", "434": "<p>INT. RILEY’S ROOM\n</p>", "435": "<p>Mom sits next to Riley.\n</p>", "436": "<p>MOM Still no moving van. Now they’re saying it won’t be here ‘til Tuesday, can you believe it?\n</p>", "437": "<p>INT. HEADQUARTERS\n</p>", "438": "<p>ANGER Toot toot toot!\n</p>", "439": "<p>INT. RILEY’S ROOM\n</p>", "440": "<p>RILEY Where’s Dad?\n</p>", "441": "<p>MOM On the phone. This new venture is keeping him pretty busy. Your dad’s a little stressed -- you know, about getting his new company up and running...\n</p>", "442": "<p>INT. HEADQUARTERS\n</p>", "443": "<p>ANGER I rest my case!\n</p>", "444": "<p>Joy sighs. She falls back from the controls. Anger steps up to the console.\n</p>", "445": "<p>ANGER (CONT’D) Now for a few well-placed withering scowls.\n</p>", "446": "<p>INT. RILEY’S ROOM\n</p>", "447": "<p>MOM I guess all I really want to say is: thank you.\n</p>", "448": "<p>INT. HEADQUARTERS\n</p>", "449": "<p>ANGER Huh?\n</p>", "450": "<p>Anger drops the controls.\n</p>", "451": "<p>INT. RILEY’S ROOM\n</p>", "452": "<p>MOM You know, through all this confusion you’ve stayed... well, you’ve stayed our happy girl!\n</p>", "453": "<p>Mom brushes Riley’s cheek.\n</p>", "454": "<p>MOM (CONT’D) Your dad’s under a lot of pressure. But if you and I can keep smiling, it would be a big help. We can do that for him, right?\n</p>", "455": "<p>INT. HEADQUARTERS\n</p>", "456": "<p>Joy, smiling with renewed purpose, steps back to the console.\n</p>", "457": "<p>JOY Whoa! Well.\n</p>", "458": "<p>INT. RILEY’S ROOM\n</p>", "459": "<p>RILEY (smiles) Yeah! Sure.\n</p>", "460": "<p>MOM What did we do to deserve you? (kisses Riley) Sweet dreams.\n</p>", "461": "<p>RILEY Good night.\n</p>", "462": "<p>INT. HEADQUARTERS\n</p>", "463": "<p>ANGER Well, you can’t argue with Mom. “Happy” it is.\n</p>", "464": "<p>FEAR Team Happy! Sounds great!\n</p>", "465": "<p>DISGUST I’m totally behind you, Joy.\n</p>", "466": "<p>INT. RILEY’S ROOM\n</p>", "467": "<p>Riley goes to sleep.\n</p>", "468": "<p>INT. HEADQUARTERS\n</p>", "469": "<p>The screen goes black.\n</p>", "470": "<p>JOY Looks like we’re going into REM. I got Dream Duty, so I’ll take care of sending these to Long Term. Great day today, guys! Sleep well TEAM HAPPY!\n</p>", "471": "<p>The team heads off to bed. Harp music plays.\n</p>", "472": "<p>JOY (CONT’D) Alright, what's on tonight, Dream Production?\n</p>", "473": "<p>ON THE SCREEN: a DREAM COMES UP.\n</p>", "474": "<p>The family FLIES happily through the air in the car. They land in front of the house--\n</p>", "475": "<p>DAD Well, this is it. The new place.\n</p>", "476": "<p>-- except it’s haunted! Organ music. Ghosts howling. The dead\n</p>", "477": "<p>mouse rises up into frame.\n</p>", "478": "<p>MOUSE Come live with me, Riley!\n</p>", "479": "<p>The mouse falls over, dead. A bear enters, holding a pizza.\n</p>", "480": "<p>PIZZA BEAR Somebody order a broccoli pizza?\n</p>", "481": "<p>The pizza slices hop up and dance a jig.\n</p>", "482": "<p>PIZZA SLICE Eat me! I’m organic!\n</p>", "483": "<p>INT. RILEY’S ROOM\n</p>", "484": "<p>Riley frowns in her sleep.\n</p>", "485": "<p>INT. HEADQUARTERS\n</p>", "486": "<p>JOY Ah, NO, who is in charge of programming down there?! I know I’m not supposed to do this, but...\n</p>", "487": "<p>Joy ducks behind the console and REBOOTS it. The dream ends.\n</p>", "488": "<p>INT. RILEY’S ROOM - NIGHT\n</p>", "489": "<p>Riley still looks troubled.\n</p>", "490": "<p>INT. HEADQUARTERS\n</p>", "491": "<p>JOY We are not going to end the day like this.\n</p>", "492": "<p>Joy has a thought. She recalls a memory.\n</p>", "493": "<p>ON THE SCREEN: Riley ice skates with her parents.\n</p>", "494": "<p>Joy watches, loving this kid. She shadows Riley, “skating” around headquarters.\n</p>", "495": "<p>JOY (CONT’D[ Don’t you worry. I’m gonna make sure that tomorrow is another great day. I promise.\n</p>", "496": "<p><i>(It is now morning; Joy is playing the accordion. Inside the house on the second level, the other emotions wake up, clearly unamused at this.)</i>\n</p>", "497": "<p><b>Joy:</b> Hello, did I wake you?\n</p>", "498": "<p><b>Anger:</b> Do you have to play that?!\n</p>", "499": "<p><b>Joy:</b> Well, I have to practice. And I don't think of it as playing so much as hugging.\n</p>", "500": "<p><i>(They head downstairs.)</i>\n</p>", "501": "<p><b>Joy:</b> OK, first day of school. Very, very exciting. I was up late last night figuring out a new plan. Here it is: Fear!\n</p>", "502": "<p><b>Fear:</b> Huh?\n</p>", "503": "<p><b>Joy:</b> I need a list of all the possible negative outcomes on the first day at a new school.\n</p>", "504": "<p><b>Fear:</b> Way ahead of you there. Does anyone know how to spell meteor?\n</p>", "505": "<p><b>Joy:</b> Disgust, make sure Riley stands out today. But, also blends in.\n</p>", "506": "<p><b>Disgust:</b> When I'm through, Riley will look so good, the other kids will look at their own outfits and <i>barf.</i>\n</p>", "507": "<p><b>Joy:</b> Joy! \"Yes, Joy?\" You'll be in charge of the console. Keeping Riley happy all day long. And may I add, I love your dress, it's adorable. \"Oh, this old thing. Thank you so much.\" I love the way it twirls.\n</p>", "508": "<p><i>(Outside, a train's horn is heard as it pulls in.)</i>\n</p>", "509": "<p><b>Joy:</b> Train of Thought, right on schedule. Anger, unload the daydreams. I ordered extra, in case things get slow in class. Might come in handy.\n</p>", "510": "<p><b>Anger:</b> If this new school is full of boring, useless classes. Which it probably will be.\n</p>", "511": "<p><b>Joy:</b> Oh, Sadness. I have a super important job just for you.\n</p>", "512": "<p><b>Sadness:</b> Really?\n</p>", "513": "<p><b>Joy:</b> M-hm, follow me.\n</p>", "514": "<p><i>(Somewhere else, she draws a chalk circle around Sadness' feet.)</i>\n</p>", "515": "<p><b>Sadness:</b> What are you doing?\n</p>", "516": "<p><b>Joy:</b> And there. Perfect. This is the circle of sadness. Your job is to make sure that all the sadness stays inside of it. So, you want me just to stand here? Hey, it's not my place to tell you how to do your job. Just make sure that all... the sadness stays in the circle. See? You're a pro at this! Isn't this fun?\n</p>", "517": "<p><b>Sadness:</b> No.\n</p>", "518": "<p><b>Joy:</b> Atta girl.\n</p>", "519": "<p><i>(She walks back to the front of the room.)</i>\n</p>", "520": "<p><b>Joy:</b> Alright everyone, fresh start. We're going to have a good day which will turn into a good week, which will turn into a good year, which turns into a good life!\n</p>", "521": "<p><i>(Riley heads for the door.)</i>\n</p>", "522": "<p><b>Mrs. Andersen:</b> So, big day. New school, new friends, huh?\n</p>", "523": "<p><b>Riley:</b> I know. I'm kind of nervous but I'm mostly excited. How do I look?\n</p>", "524": "<p><i>(In Headquarters, Joy watches Family Island start up out the window.)</i>\n</p>", "525": "<p><b>Riley:</b> Do you like my purse?\n</p>", "526": "<p><b>Mrs. Andersen:</b> Very cute! You gonna be Okay? You want us to walk with you?\n</p>", "527": "<p><b>Disgust:</b> Mom and Dad, with us in public?! No, thank you.\n</p>", "528": "<p><b>Joy:</b> Yup, I'm on it.\n</p>", "529": "<p><i>(She pushes a button and Riley picks up.)</i>\n</p>", "530": "<p><b>Riley:</b> Nope, I'm fine. Bye Mom. Bye Dad.\n</p>", "531": "<p><b>Mr. Andersen:</b> <i>(putting a call on hold)</i> Have a good day at school, monkey.\n</p>", "532": "<p><i>(They make monkey noises at each other; Goofball Island sets off. Riley giggles and exits.)</i>\n</p>", "533": "<p><b>Mrs. Andersen:</b> Have a great day, sweetheart.\n</p>", "534": "<p><i>(Outside, Riley walks down the sidewalk until she comes to her new school; she stops and hesitates.)</i>\n</p>", "535": "<p><b>Fear:</b> Are you sure we want to do this?\n</p>", "536": "<p><b>Joy:</b> In we go!\n</p>", "537": "<p><i>(This prompts Riley to go right for it.)</i>\n</p>", "538": "<p><b>Fear:</b> OK, going in. Yes!\n</p>", "539": "<p><i>(Riley sits in her new classroom; students talk amongst each other. Riley notices them; Disgust picks up three girls in particular.)</i>\n</p>", "540": "<p><b>Disgust:</b> OK. We've got a group of cool girls at 2 o'clock.\n</p>", "541": "<p><b>Joy:</b> How do you know?\n</p>", "542": "<p><b>Disgust:</b> Double ears pierced, infinity scarf.\n</p>", "543": "<p><i>(Their leader turns around.)</i>\n</p>", "544": "<p><b>Joy:</b> Woah! Is she wearing eyeshadow?\n</p>", "545": "<p><b>Disgust:</b> Yeah, we want to be friends with them.\n</p>", "546": "<p><b>Joy:</b> Let's go talk to them! <i>(starts to work)</i>\n</p>", "547": "<p><b>Disgust:</b> Are you kidding?! We're not talking to them! We want them to like us.\n</p>", "548": "<p><b>Joy:</b> Oh, yeah. Wait, what?\n</p>", "549": "<p><i>(Fear comes over holding a stack of sheets.)</i>\n</p>", "550": "<p><b>Fear:</b> Almost finished with the potential disasters. Worst scenario is either quicksand, spontaneous combustion, or getting called on by the teacher. So as long as none of this happens...\n</p>", "551": "<p><i>(The teacher arrives and steps to the front of the room.)</i>\n</p>", "552": "<p><b>Teacher:</b> OK, everybody, we have a new student in class today.\n</p>", "553": "<p><b>Fear:</b> <i>(scatters the sheets in fright)</i> Are you kidding me?! Out of the gate! This is not happening!\n</p>", "554": "<p><b>Teacher:</b> Riley, would you like to tell us something about yourself?\n</p>", "555": "<p><b>Fear:</b> NOOO! Pretend we can't speak English!\n</p>", "556": "<p><b>Joy:</b> Don't worry, I got this.\n</p>", "557": "<p><i>(She does her work; this prompts Riley to speak up.)</i>\n</p>", "558": "<p><b>Riley:</b> Um, okay... <i>(stands)</i> My name is Riley Anderson. I'm from Minnesota and now I live here.\n</p>", "559": "<p><i>(She glances over at some of the students and the cool girl.)</i>\n</p>", "560": "<p><b>Teacher:</b> And how about Minnesota? Can you tell us something about it? Well, you certainly get a lot more snow than we do. <i>(chuckles)</i>\n</p>", "561": "<p><b>Joy:</b> <i>(also chuckles)</i> She's hilarious...!\n</p>", "562": "<p><i>(She does more work.)</i>\n</p>", "563": "<p><b>Riley:</b> Yeah, it gets pretty cold. The lake freezes over and that’s when we play hockey. I'm on a great team. We're called the Prairie Dogs. My friend, Meg, plays forward, and my dad's the coach.\n</p>", "564": "<p><i>(Joy pushes a button which makes a happy memory comes down the recall tube and projects onto the screen; it shows the Andersens playing hockey on a frozen pond.)</i>\n</p>", "565": "<p><b>Riley:</b> Pretty much everyone in my family skates. It's kind of a family tradition. We go out on the lake almost every weekend.\n</p>", "566": "<p><i>(Suddenly, the memory turns blue; Riley's mood sinks.)</i>\n</p>", "567": "<p><b>Riley:</b> Or, we did, till... I moved away.\n</p>", "568": "<p><b>Disgust:</b> Hey. What gives?\n</p>", "569": "<p><b>Fear:</b> Wait, what?\n</p>", "570": "<p><i>(The culprit is Sadness, who has left her circle and touched the memory, changing it.)</i>\n</p>", "571": "<p><b>Joy:</b> Hey! Sadness!? You touched a memory!? We talked about this!\n</p>", "572": "<p><b>Sadness:</b> Oh, yeah, I know. I'm sorry.\n</p>", "573": "<p><b>Joy:</b> Get back in your circle!\n</p>", "574": "<p><i>(She attempts to cheer Riley, but the console does not respond.)</i>\n</p>", "575": "<p><b>Joy:</b> Ugh... What's going on!?!\n</p>", "576": "<p><b>Fear:</b> Get it out of there, Joy!\n</p>", "577": "<p><b>Joy:</b> Eject!!\n</p>", "578": "<p><i>(Still nothing happens; Riley's homesickness begins to take over.)</i>\n</p>", "579": "<p><b>Riley:</b> <i>(sniffs; voice shakes)</i> We... used to... play tag, and stuff...\n</p>", "580": "<p><b>Disgust:</b> Cool kids whispering at 3 o'clock!\n</p>", "581": "<p><i>(Indeed the cool girls are whispering to each other.)</i>\n</p>", "582": "<p><b>Fear:</b> Did you see that look?\n</p>", "583": "<p><b>Joy:</b> Oh, no.\n</p>", "584": "<p><b>Fear:</b> They're judging us!\n</p>", "585": "<p><i>(Joy and the emotions struggle to remove the memory from the recall unit; behind them, Sadness notices the console is open and rushes toward it...)</i>\n</p>", "586": "<p><b>Joy:</b> Somebody help, grab that thing... Everybody put in...\n</p>", "587": "<p><b>Riley:</b> <i>(beginning to cry)</i> But, everything's different now... Since we moved...\n</p>", "588": "<p><i>(She starts shedding tears and sniffs again; the students stare at her in silence.)</i>\n</p>", "589": "<p><b>Fear:</b> Oh no. WE'RE CRYING! <i>AT SCHOOL!!</i>\n</p>", "590": "<p><b>Joy:</b> Wha...?!\n</p>", "591": "<p><i>(Still struggling, Joy sees Sadness is working the console, it responding to her and her alone.)</i>\n</p>", "592": "<p><b>Joy:</b> Sadness, what are you doing!!?!\n</p>", "593": "<p><i>(She successfully ejects the memory and rushes up to her, pulling her away from the console.)</i>\n</p>", "594": "<p><b>Sadness:</b> Whoa!!! I'm sorry. Oh...oh!\n</p>", "595": "<p><i>(A loud flash and ding is heard; a new core memory appears from behind the screen. Unlike the others, this one is blue and sad.)</i>\n</p>", "596": "<p><b>Fear:</b> <i>(gasps)</i> It's a core memory.\n</p>", "597": "<p><b>Disgust:</b> But it's blue.\n</p>", "598": "<p><i>(Indeed it is; it shows Riley crying in front of the whole class due to her homesickness.)</i>\n</p>", "599": "<p><b>Joy:</b> <i>(gasps)</i> No, wait! Stop it! No! Agh! No!\n</p>", "600": "<p><i>(The memory sinks into the floor before she could grab it; it flows down through the track to the core memory pedestal, and she opens the pedestal and grabs the memory just before it could settle in. She then pushes the \"end of day memory flush\" button to activate the recall tube and flush all the memories off the shelves.)</i>\n</p>", "601": "<p><b>Sadness:</b> Joy, no. <i>(Tries to pull the memory away)</i> That's a core memory! ...Wait!\n</p>", "602": "<p><b>Joy:</b> Hey! Stop it! Let go!\n</p>", "603": "<p><i>(She breaks free of her grasp; she stumbles backward and hits the pedestal, causing all the core memories to fall out, and the pedestal powers down as they gasp.)</i>\n</p>", "604": "<p><b>Fear:</b> The core memories!\n</p>", "605": "<p><i>(The result causes the light poles to go out; the core memories power down and become greyscale. Riley's head raises, still breaking down and losing thought.)</i>\n</p>", "606": "<p><b>Joy:</b> AGH!\n</p>", "607": "<p><i>(She throws the sad core memory aside and gathers up all the happy ones that fell out. But then she sees Sadness trying to insert the sad core memory and gasps; she jumps at Sadness and she loses grip, dropping the sad core memory as it rolls toward the activated recall tube and gets sucked up through it and out of the roof to Long Term Memory. But it is still not done yet; one of the happy core memories begins rolling toward the still-sucking tube as well as it starts coming down from the ceiling.)</i>\n</p>", "608": "<p><b>Joy:</b> NO NO NO NO -- !\n</p>", "609": "<p><i>(She grabs the memory but gets sucked up the tube herself; she tries to keep herself weighed down by keeping her foot hooked outside; she struggles to reach her other foot down, but Sadness gets sucked toward her as well!)</i>\n</p>", "610": "<p><b>Sadness:</b> Whoa...\n</p>", "611": "<p><i>(Both Joy and Sadness are sucked up!)</i>\n</p>", "612": "<p><b>Joy, Sadness:</b> AAAAGH!!\n</p>", "613": "<p><i>(They disappear out the roof hatch, and the door closes as the tube retracts. Riley silently sits down and wipes her tears.)</i>\n</p>", "614": "<p><b>Teacher:</b> Thank you, Riley. I know it can be tough moving to a new place. But we're happy to have you here. Alright everyone, get out your history books, and turn to chapter 7.\n</p>", "615": "<p><i>(The students do so; Riley hides her face behind her book, not saying a word. In Headquarters, the remaining emotions are still distraught.)</i>\n</p>", "616": "<p><b>Anger:</b> Can I say that curse word now?\n</p>", "617": "<p>[Joy and Sadness scream as they rocket down the tube. Joy desperately tries to hold on to the core memories. The blue core memory is sorted to a side tube. Joy lands in a bin of memories. Sadness crashes next to her.]\n</p>", "618": "<p><b>Joy:</b> Oh no... (gathering memories) One, two, three... okay, got ’em. Wha-- where are we?\n</p>", "619": "<p>[Joy takes in the shelving around her.]\n</p>", "620": "<p><b>Joy:</b>  Long-Term Memory...!\n</p>", "621": "<p>[Joy grabs the core memories and jumps out of the dumpster. She sees GOOFBALL ISLAND, silent and dark.]\n</p>", "622": "<p><b>Joy:</b>  Goofball Island?\n</p>", "623": "<p>[Joy surveys the islands beyond. They’re all dark.]\n</p>", "624": "<p><b>Sadness:</b> Hoh... Riley’s Islands of Personality. They’re ALL down! This is bad.\n</p>", "625": "<p><b>Joy:</b>  We-- we can fix this. We just have to get back to Headquarters, plug the core memories in, and Riley will be back to normal.\n</p>", "626": "<p>[Joy and Sadness hurry towards headquarters.]\n</p>", "627": "<p><b>Sadness:</b> Riley has no core memories, no personality islands and no-- (gasp)\n</p>", "628": "<p><b>Joy:</b> Wha-- What is it?\n</p>", "629": "<p><b>Sadness:</b> You! YOU’RE not in headquarters. Without you, Riley can’t be happy. We gotta get you back up there.\n</p>", "630": "<p><b>Joy:</b> I’m coming, Riley.\n</p>", "631": "<p>[They set off across the bridge to Goofball Island. We see the LIGHTLINE beyond it, leading towards Headquarters.]\n</p>", "632": "<p><b>Mrs. Andersen:</b> So, as it turns out, the green trash can is not recycling. It's for greens, like compost and eggshells. And the blue one is recycling, and the black...\n</p>", "633": "<p><b>Disgust:</b> Riley's acting so weird! Why is she acting so weird?\n</p>", "634": "<p><b>Anger:</b> What do you expect? All the Islands are down! \n</p>", "635": "<p><b>Disgust:</b> Joy would know what to do.\n</p>", "636": "<p><b>Fear:</b> That's it! Until she gets back, we just do what Joy would do.\n</p>", "637": "<p><b>Disgust</b>: Good idea! Anger, Fear, Disgust... How are we supposed to be happy?\n</p>", "638": "<p><b>Mrs. Andersen</b>: Hey, Riley, I got good news. I found a Junior Hockey League, right here in San Francisco. And get this! Tryouts are tomorrow after school. What luck, right?\n</p>", "639": "<p><b>Anger:</b> Hockey? \n</p>", "640": "<p><b>Disgust:</b> Uh-oh, what do we do? \n</p>", "641": "<p><b>Fear:</b> Guys, th-this... You pretend to be Joy.\n</p>", "642": "<p>[Fear pushes Disgust forward. She steps up to drive.]\n</p>", "643": "<p><b>Mrs. Andersen</b>: Wouldn't it be great to be back out on the ice?\n</p>", "644": "<p><b>Riley:</b> Oh, yeah, that sounds fantastic.\n</p>", "645": "<p><b>Fear:</b> What was that? That wasn't anything like Joy!\n</p>", "646": "<p><b>Disgust:</b> Ah, because I'm NOT Joy!\n</p>", "647": "<p><b>Fear:</b> Yeah, no kidding!\n</p>", "648": "<p>Did you guys pick up on that?\n</p>", "649": "<p>Yeah, something's wrong.\n</p>", "650": "<p>Should we ask her?\n</p>", "651": "<p>Let's probe. But keep it subtle so she doesn't notice.\n</p>", "652": "<p><b>Mrs. Andersen:</b> So, how was the first day of school?\n</p>", "653": "<p><b>Anger:</b> She's probing us.\n</p>", "654": "<p><b>Disgust:</b> I'm done. You pretend to be Joy.\n</p>", "655": "<p><b>Fear:</b> What? OK...\n</p>", "656": "<p><b>Riley</b>: It was fine, I guess, I dunno.\n</p>", "657": "<p><b>Disgust:</b> Oh, very smooth. That was just like Joy.\n</p>", "658": "<p>Something is definitely going on!\n</p>", "659": "<p>She's never acted like this, before. What should we do?\n</p>", "660": "<p>We're gonna find out what's happening. But we'll need support. Signal the husband.\n</p>", "661": "<p><b>Mrs. Andersen</b>: Ahem!\n</p>", "662": "<p>Uh-oh! She's looking at us.  What did she say?\n</p>", "663": "<p>What? Oh, sorry sir, no one was listening.\n</p>", "664": "<p>Is it garbage night? We left the toilet seat up? What? What is it, woman? What?\n</p>", "665": "<p>He's making that stupid face again.\n</p>", "666": "<p>I could strangle him right now!\n</p>", "667": "<p>Signal him again.\n</p>", "668": "<p><b>Mr. Andersen:</b> Ah! So... Riley, how was school?\n</p>", "669": "<p>Aw, Seriously?\n</p>", "670": "<p>You gotta be kidding me!\n</p>", "671": "<p>For this, we gave up that Brazilian helicopter pilot?!\n</p>", "672": "<p><b>Anger:</b> Move! I'll be Joy.\n</p>", "673": "<p><b>Riley:</b> School was great, alright!\n</p>", "674": "<p><b>Mrs. Andersen:</b> Riley? Is everything OK?\n</p>", "675": "<p>Sir, she just rolled her eyes at us.\n</p>", "676": "<p>What is her deal? Alright, make a show of force. I don't wanna have to put the foot down.\n</p>", "677": "<p><b>Dad's Fear:</b> No, not the foot!\n</p>", "678": "<p><b>Mr. Andersen:</b> Riley, I do not like this new attitude.\n</p>", "679": "<p><b>Anger:</b> Oh, I'll show you attitude, old man!\n</p>", "680": "<p><b>Fear:</b> No, no-no, stay happy.\n</p>", "681": "<p>[Anger shoves him away and hits a button.]\n</p>", "682": "<p><b>Riley:</b> What is your problem? Just leave me alone!\n</p>", "683": "<p>Sir, reporting high level of sass.\n</p>", "684": "<p>Take it to DefCon 2.\n</p>", "685": "<p>Your heard that gentlemen. DefCon 2!\n</p>", "686": "<p><b>Mr. Andersen:</b> Listen, young lady, I don't know where this disrespectful attitude came from.\n</p>", "687": "<p><b>Anger:</b> You wanna piece of this, pops? Come and get it!\n</p>", "688": "<p><b>Riley:</b> Yeah? Well, well...\n</p>", "689": "<p>Here it comes. Prepare the foot!\n</p>", "690": "<p>Keys, to Safety Position! Ready to launch on your command, sir.\n</p>", "691": "<p><b>Riley:</b> Just, shut up!\n</p>", "692": "<p>Fire!\n</p>", "693": "<p><b>Mr. Andersen:</b> That's it. Go to your room! Now!\n</p>", "694": "<p>Foot is down. The foot is down! Woo!\n</p>", "695": "<p>Good job, gentlemen. That could've been a disaster.\n</p>", "696": "<p>Well, that was a disaster.\n</p>", "697": "<p>Come, fly with me, gatinha. (kitten)\n</p>", "698": "<p>[Joy and Sadness have made it across Goofball Island and must now walk across the thin lightline. Below is the darkness of the Memory Dump.]\n</p>", "699": "<p><b>Sadness:</b> We’re gonna walk out there? On that?\n</p>", "700": "<p><b>Joy:</b> It’s the quickest way back.\n</p>", "701": "<p><b>Sadness:</b> But it’s right over the Memory Dump. If we fall, we’ll be forgotten forever!\n</p>", "702": "<p><b>Joy:</b> We have to do this. For Riley. Just follow my footsteps.\n</p>", "703": "<p><b>Sadness</b>: Hohh... ok.\n</p>", "704": "<p><b>Joy:</b> (stepping onto lightline) It's not that high. It’s totally fiii... Whoa...\n</p>", "705": "<p>[She loses her balance. Almost drops a memory over the side. Sadness steps out onto the lightline. They inch along.]\n</p>", "706": "<p>LATER Dad knocks on Riley’s door, peeks in.\n</p>", "707": "<p><b>Mr. Andersen:</b>  Hey.\n</p>", "708": "<p>Riley’s in her sleeping bag. She doesn’t answer.\n</p>", "709": "<p><b>Mr. Andersen</b>: So uh, things got a little out of hand downstairs. You want to talk about it? (still no answer) Come on. Where’s my happy girl? Monkey. (he tries monkey noises)\n</p>", "710": "<p>He’s trying to start up Goofball. \n</p>", "711": "<p>Fear looks at the empty Core Memory Holder, then out the window: GOOFBALL ISLAND is dark and silent.\n</p>", "712": "<p><b>Mr. Andersen</b>:: Come on. (tries more monkey noises)\n</p>", "713": "<p>Riley looks at Dad, but TURNS AWAY.\n</p>", "714": "<p>[Goofball Island crumbles and breaks. Joy sees the lightline breaking ahead.]\n</p>", "715": "<p><b>Joy:</b> Ahhh! Go back! RUN! RUN! RUN!\n</p>", "716": "<p>[They run back onto Goofball Island as the lightline crumbles. Joy and Sadness frantically outrun collapsing debris. They leap across the buckling bridge, making it over to the cliff just in time to see Goofball Island fall into the dump.]\n</p>", "717": "<p><b>Joy</b>: What--?\n</p>", "718": "<p>[Joy watches it sink.]\n</p>", "719": "<p><b>Mr. Andersen:</b> I get it, you need some alone time. We’ll talk later.\n</p>", "720": "<p>The Emotions stare out the back window in disbelief.\n</p>", "721": "<p><b>Disgust:</b> We have a major problem.\n</p>", "722": "<p><b>Fear:</b> Ohh, Joy where are you?\n</p>", "723": "<p><i>(Joy watches, still in shock.)</i>\n</p>", "724": "<p><b>Sadness:</b> Oh, we lost Goofball Island. That means she can lose Friendship, and Hockey, and Honesty, and Family...! You can fix this, right, Joy?\n</p>", "725": "<p><b>Joy:</b> I-I...ah... I don't know. But we have to try. OK, come on. \n</p>", "726": "<p>[The sky darkens]\n</p>", "727": "<p><b>Joy:</b>  Riley's gone to sleep. Which is a good thing... When you think about it, because nothing else bad can happen while she's asleep. We'll be back to Headquarters before she wakes up. We'll just go across Friendship Island. \n</p>", "728": "<p>[Shelves jut out over the cliff edge, making Friendship Island inaccessible.]\n</p>", "729": "<p><b>Sadness</b>: We’ll never make it, hoh... nooo... \n</p>", "730": "<p><b>Joy:</b> No, no, no, don’t obsess over the weight of life’s problems! Remember the funny movie where the dog dies?!\n</p>", "731": "<p>[Sadness face plants.]\n</p>", "732": "<p><b>Joy:</b> Sadness, we don’t have time for this.\n</p>", "733": "<p>[She looks to her side. Memory shelves wind into the distance. Joy heads off into the maze.]\n</p>", "734": "<p><b>Joy:</b> We’ll just have to go around! Take the scenic route.\n</p>", "735": "<p><b>Sadness:</b> Wait! Joy, you could get lost in there!\n</p>", "736": "<p><b>Joy:</b> Think positive!\n</p>", "737": "<p><b>Sadness:</b> Okay. I’m positive you will get lost in there. That’s Long-Term Memory. An endless warren of corridors and shelves. I read about it in the manuals.\n</p>", "738": "<p><b>Joy</b>: The manuals? The manuals! You read the manuals!\n</p>", "739": "<p><b>Sadness:</b> Yeah...\n</p>", "740": "<p><b>Joy:</b> So you know the way back to headquarters!\n</p>", "741": "<p><b>Sadness:</b> I, guess...\n</p>", "742": "<p><b>Joy</b>: You are my map! Let’s go! Lead on, Mind Map! Show me where we’re going!\n</p>", "743": "<p><b>Sadness</b>: Okay! Only, I’m too sad to walk. Just give me a few... hours.\n</p>", "744": "<p>[Joy grabs Sadness’ leg and DRAGS her into the shelves.]\n</p>", "745": "<p><b>Joy</b>: Which way? Left? \n</p>", "746": "<p><b>Sadness:</b> Right. (Joy turns right) No. I mean, go left. I said left was right, like “correct.”\n</p>", "747": "<p><b>Joy:</b> Okay.\n</p>", "748": "<p><b>Sadness:</b> This actually feels kind of nice.\n</p>", "749": "<p>[Joy heads off into the COMPLICATED LABYRINTH ahead of them.]\n</p>", "750": "<p><b>Joy:</b> Okay! Here we go. We’ll be back to Headquarters before morning. We can do it. This’ll be easy. This is working!\n</p>", "751": "<p>[Hours later]\n</p>", "752": "<p><b>Joy:</b> [exhausted] This is not working. Are we getting close?\n</p>", "753": "<p><b>Sadness:</b> Yeah. Just another right. And a left. Then another left, and a right...\n</p>", "754": "<p><b>Joy:</b>  Are you sure you know where we’re going? Because we seem to be walking AWAY from Headquarters.\n</p>", "755": "<p>[The SKY BRIGHTENS]\n</p>", "756": "<p><b>Joy:</b>  Riley’s awake.\n</p>", "757": "<p>[Even though she is still exhausted, the core memories begin to drop. Sadness reaches to grab it.]\n</p>", "758": "<p><b>Joy:</b>  Ah ah ah, don’t touch, remember? If you touch them, they stay sad!\n</p>", "759": "<p><b>Sadness:</b> Oh. Sorry. I won’t... ..starting now.\n</p>", "760": "<p>[Joy looks behind her. The bottom row of memories are BLUE.]\n</p>", "761": "<p><b>Joy:</b> [defeated] I can’t take much more of this.\n</p>", "762": "<p><b>Male Forgetter</b>:  (O.S.) Forget ‘em!\n</p>", "763": "<p><b>Joy:</b> Mind Workers!\n</p>", "764": "<p>[Joy runs off toward the voice.]\n</p>", "765": "<p><b>Sadness:</b> But Joy, we’re almost... ohhhh.\n</p>", "766": "<p>[LATER Joy finds two workers vacuuming up memories from the shelves.]\n</p>", "767": "<p><b>Female Forgetter:</b> Phone numbers. We don’t need all of these. They’re in her phone.\n</p>", "768": "<p><b>Male Forgetter:</b> Just forget all of that. Please.\n</p>", "769": "<p><b>Joy</b>: Excuse me. Hi.\n</p>", "770": "<p><b>Male Forgetter</b>: Forget it!\n</p>", "771": "<p><b>Joy:</b> I need to find Friendship Island...\n</p>", "772": "<p><b>Female Forgetter</b>: (pointing to memories) Look at this. Four years of piano lessons.\n</p>", "773": "<p><b>Male Forgetter</b>: Yeah, looks pretty faded.\n</p>", "774": "<p><b>Female Forgetter</b>: You know what? Save \"Chopsticks” and “Heart and Soul,” get rid of the rest.\n</p>", "775": "<p>[Zoop! The memories get vacuumed up.]\n</p>", "776": "<p><b>Joy:</b> Are you--\n</p>", "777": "<p><b>Female Forgetter:</b>  U.S. Presidents. What do you think?\n</p>", "778": "<p><b>Male Forgetter</b>: Eh, just keep Washington, Lincoln and the fat one.\n</p>", "779": "<p><b>Female Forgetter:</b> Forget ‘em!\n</p>", "780": "<p><b>Joy:</b> Hey! You can’t throw those away! Those are perfectly good memories.\n</p>", "781": "<p><b>Male Forgetter</b>: The names of every “Cutie Pie Princess” doll?\n</p>", "782": "<p><b>Joy:</b> Yes! That is critical information! Glitterstorm, Honeypants, Officer Justice...\n</p>", "783": "<p><b>Female Forgetter:</b> Forget ‘em!\n</p>", "784": "<p>[He vacuums up the memories behind Joy. The memories shoot out a sewer pipe and fall into the darkness of the Memory Dump.]\n</p>", "785": "<p><b>Joy:</b> Hey! Bring those back.\n</p>", "786": "<p><b>Female Forgetter:</b> They’re in the dump. Nothing comes back from the dump.\n</p>", "787": "<p><b>Male Forgetter:</b> Yeah. Look lady, this is our job, OK?\n</p>", "788": "<p><b>Female Forgetter:</b> When Riley doesn’t care about a memory, it fades.\n</p>", "789": "<p><b>Joy</b>: Fades?\n</p>", "790": "<p><b>Female Forgetter:</b> Happens to the best of ‘em.\n</p>", "791": "<p><b>Male Forgetter:</b> (pulls memory from a cart) Except for this bad boy! This one will NEVER fade.\n</p>", "792": "<p><b>Joy:</b> (recognizing it) The song from the gum commercial?\n</p>", "793": "<p><b>Male Forgetter</b>: (conspiratorial) Sometimes we send that one up to headquarters for no reason.\n</p>", "794": "<p><b>Female Forgetter:</b> It just plays in Riley’s head over and over again. Like a million times! Ha! Let’s watch it again!\n</p>", "795": "<p>[She rewinds it and plays it again. They sing along.]\n</p>", "796": "<p><b>Joy</b>: We all know the song. Okay. Yup. Real catchy.\n</p>", "797": "<p><b>Male Forgetter</b>: (to Female Forgetter) What do ya think? Should we do it?\n</p>", "798": "<p><b>Female Forgetter:</b>  Yeah! Ha ha!\n</p>", "799": "<p><b>Male Forgetter:</b> OK, here we go! Ha ha ha!\n</p>", "800": "<p>[He tips the gum memory into the inner workings of the shelf. FWOOM! It shoots up towards Headquarters. Fear, Anger and Disgust are having a peaceful morning. The memory drops into Headquarters, playing at full volume.]\n</p>", "801": "<p><b>Gum memory:</b> Tripledent gum will make you smile! Tripledent gum! It lasts a while-\n</p>", "802": "<p><b>Anger</b>: Wha-- this again!?!\n</p>", "803": "<p>[The Forgetters walk away, laughing and singing.]\n</p>", "804": "<p><b>Joy:</b> (following them) Wait! Do you know how to get to Friendship Island?!\n</p>", "805": "<p><i>(Riley is having a FaceTime call with Meg.)</i>\n</p>", "806": "<p><b>Riley:</b> ♪ TripleDent gum... <i>(Hums the rest)</i>\n</p>", "807": "<p><b>Meg:</b> Do you like it there? Did you feel any earthquakes? Is the bridge cool?\n</p>", "808": "<p><b>Riley:</b> Yeah, it's good. What happened with the playoffs?\n</p>", "809": "<p><b>Meg:</b> We won the first game. Coach says we might actually go to the finals this year. Oh, and we got this new girl on the team. She's so cool!\n</p>", "810": "<p><b>Disgust:</b>  Ah, she did not just say that!\n</p>", "811": "<p><b>Fear:</b>  A new girl? Meg has a new friend already?\n</p>", "812": "<p><b>Meg:</b> Hey-hey! Stay happy. We do not wanna lose any more islands here, guys. We can pass the puck to each other without even looking. It's like mind reading.\n</p>", "813": "<p><b>Anger</b>: You like to read minds, Meg? I got something for you to read right here!\n</p>", "814": "<p><b>Fear:</b> W-wait, let's just be calm for 1 sec...\n</p>", "815": "<p><b>Riley:</b> I gotta go.\n</p>", "816": "<p><b>Meg:</b> What?\n</p>", "817": "<p><b>Riley:</b> <i>(angrily)</i> I GOTTA <i>GO!</i> <i>(furiously slams her laptop closed)</i>\n</p>", "818": "<p>[Joy follows the Forgetters, trying to get directions. They ignore her, singing the gum-commercial jingle.]\n</p>", "819": "<p><b>Joy:</b> Could you just please tell me which way is...\n</p>", "820": "<p>[A horrible mechanical GROANING sound. Joy reacts.]\n</p>", "821": "<p><b>Joy</b>: Oh no!\n</p>", "822": "<p>[Joy rounds a corner and sees Friendship Island crumbling.]\n</p>", "823": "<p><b>Joy:</b> Friendship Island! What?\n</p>", "824": "<p>[She looks on in horror as Friendship Island falls.]\n</p>", "825": "<p><b>Joy:</b>  Ohh, not Friendship.\n</p>", "826": "<p>[Joy hugs the core memories. One of them is memory of young Riley and Meg walking together.]\n</p>", "827": "<p><b>Sadness:</b> Oh, Riley loved that one. And now it's GONE. Goodbye friendship, hello loneliness.\n</p>", "828": "<p>[Joy sees Hockey Island in the distance.]\n</p>", "829": "<p><b>Joy:</b> (trying to stay positive) We’ll just have to go the long way.\n</p>", "830": "<p>[They turn to look back into the deep memory shelves.]\n</p>", "831": "<p><b>Sadness:</b> Yeah. The long, long, looong way. I’m ready.\n</p>", "832": "<p>[Sadness lies down on the ground, offering her leg. Joy sighs. She doesn’t want to do this again.]\n</p>", "833": "<p><b>Joy:</b> There’s gotta be a better way.\n</p>", "834": "<p><b>Voice:</b>  (O.S.) (talking to the memories) Ohhh, look at you, you’re a KEEPER!\n</p>", "835": "<p><b>Joy:</b> Huh?\n</p>", "836": "<p>[Joy sees a strange figure up ahead, gathering memories.]\n</p>", "837": "<p><b>Voice:</b>  I will take you, but not you. (beat) Oh who am I kidding, I can’t leave you!\n</p>", "838": "<p><b>Joy:</b> Hello!\n</p>", "839": "<p>The figure sees Joy -- and bolts.\n</p>", "840": "<p><b>Joy:</b> (CONT’D) Wait!  Hey, wait! Stop! Joy chases after him.\n</p>", "841": "<p>[Joy rounds a corner to find the figure crouched on the ground, hiding his face in his hands like a three year old.]\n</p>", "842": "<p><b>Joy:</b> Excuse me...? \n</p>", "843": "<p><b>Bing Bong:</b> (jumping up; cornered) Ahhhh! Uh, I was looking for, uh-- (grabs a memory) --DIVERSION!\n</p>", "844": "<p>He THROWS IT and makes a run for it.\n</p>", "845": "<p><b>Bing Bong</b>: (CONT’D) Ha ha! So long, sucker!\n</p>", "846": "<p>He immediately crashes into a cart of memories.\n</p>", "847": "<p><b>Bing Bong</b>: (CONT’D) Ow! Oww, I hurt all over.\n</p>", "848": "<p><b>Joy</b> Wait. I know you.\n</p>", "849": "<p><b>Bing Bong:</b> No you don’t. I get that a lot, I look like a lot of people.\n</p>", "850": "<p><b>Joy:</b> No, I do! Bing Bong! Riley’s Imaginary Friend!\n</p>", "851": "<p><b>Bing Bong:</b> You really DO know me?\n</p>", "852": "<p><b>Joy:</b> Well of course! Riley loved playing with you, you two were best friends! Oh! You would know. We’re trying to get back to Headquarters...\n</p>", "853": "<p><b>Bing Bong:</b> Headquarters? You guys are from Headquarters?\n</p>", "854": "<p><b>Joy:</b> (mock modesty) Well, yeah. I’m Joy. This is Sadness.\n</p>", "855": "<p><b>Bing Bong:</b>  You’re Joy? THE Joy?\n</p>", "856": "<p><b>Joy:</b> Mm-hmm.\n</p>", "857": "<p><b>Bing Bong:</b>  Well, what the heck are you doing out here?\n</p>", "858": "<p><b>Joy:</b> That's a good question! You want to answer that, Sadness?\n</p>", "859": "<p><b>Bing Bong:</b> Without you, Riley won’t ever be happy. We can't have that, we gotta get you back! I’ll tell you what, follow me.\n</p>", "860": "<p><b>Joy:</b> Oh, thank you!\n</p>", "861": "<p>Bing Bong leads them on through the memory shelves.\n</p>", "862": "<p><b>Joy</b>: It is so great to see you again. I gotta tell you, I am such a huge fan of your work. Do you remember when you and Riley were in a band?\n</p>", "863": "<p>FLASH CUTS of their adventures: *Riley bangs on pots and pans, Bing Bong plays his trunk.\n</p>", "864": "<p><b>Joy:</b> (V.O.) I went to all of your concerts.\n</p>", "865": "<p><b>Bing Bong</b>: (V.O.) Yeah, I blow a mean nose.\n</p>", "866": "<p>*Bing Bong runs on ceiling, Riley chases after him.\n</p>", "867": "<p><b>Joy:</b> (V.O.) Watching you play tag was such a treat.\n</p>", "868": "<p><b>Bing Bong:</b> (V.O.) Two-time world champ.\n</p>", "869": "<p>*Riley and Bing Bong sit in her wagon (”rocket”).\n</p>", "870": "<p><b>Joy</b>: (V.O.) Oh, and remember your rocket?!\n</p>", "871": "<p><b>Bing Bong</b>: (V.O.) Of course! It runs on song power.\n</p>", "872": "<p><b>Joy:</b> That’s right, your theme song! (singing) Who's your friend who likes to play?\n</p>", "873": "<p><b>Bing Bong:</b>  (sings) BING BONG BING BONG!\n</p>", "874": "<p><b>Joy:</b> His rocket makes you yell “Hooray!”\n</p>", "875": "<p><b>Bing Bong/Joy:</b> BING BONG BING BONG!\n</p>", "876": "<p>[Sadness eyes Bing Bong, who is a pink elephant made with a cat tail.]\n</p>", "877": "<p><b>Sadness:</b> What exactly are you supposed to be?\n</p>", "878": "<p><b>Bing Bong:</b>  You know, it’s unclear. I’m mostly cotton candy, but shape-wise, I’m part cat, part elephant, part dolphin.\n</p>", "879": "<p><b>Joy:</b> Dolphin?\n</p>", "880": "<p>[Bing Bong does a spot-on dolphin impression.]\n</p>", "881": "<p><b>Bing Bong:</b>  You gotta remember, when Riley was three, animals were all the rage. The cow goes moo. The horse goes neigh. That’s all people talked about back then.\n</p>", "882": "<p><b>Joy:</b> Yeah, I guess that’s true. What are you doing out here?\n</p>", "883": "<p><b>Bing Bong:</b> Well, there’s not much call for imaginary friends lately, so, uh, you know, I’m...\n</p>", "884": "<p><b>Joy:</b> Hey, hey, don’t be sad. Tell you what, when I get back up to Headquarters, I’ll make sure Riley remembers you.\n</p>", "885": "<p><b>Bing Bong:</b> You will?\n</p>", "886": "<p><b>Joy:</b> Of course, she’d love that!\n</p>", "887": "<p><b>Bing Bong:</b> Ha ha! This is the greatest day of my life!\n</p>", "888": "<p>He launches into a jig, but hurts himself and bursts into tears. Candy pours out of his tear ducts.\n</p>", "889": "<p><b>Joy</b>: Are you okay?\n</p>", "890": "<p><b>Sadness:</b> What’s going on?\n</p>", "891": "<p><b>Bing Bong:</b> I cry candy. Try the caramel, it’s delicious.\n</p>", "892": "<p><b>Joy:</b> Ooo. (fumbles memories) Woah!\n</p>", "893": "<p><b>Bing Bong:</b> Oh-- here-- use this. (offers his satchel)\n</p>", "894": "<p><b>Joy:</b> Thanks!\n</p>", "895": "<p><b>Bing Bong</b>: Oh, hold on. Wait a second.\n</p>", "896": "<p>[He empties out an impossible amount of stuff: tons of memories, a boot, an anchor, a cat... Joy and Sadness stare in amazement.]\n</p>", "897": "<p><b>Bing Bong:</b>  What? It’s imaginary.\n</p>", "898": "<p>[Joy accepts the satchel and puts in the core memories.]\n</p>", "899": "<p><b>Joy:</b> Thanks! This’ll make it a lot easier to walk back to Headquarters.\n</p>", "900": "<p><b>Bing Bong</b>: Walk? We’re not walkin’! We’re taking the Train of Thought!\n</p>", "901": "<p>He points to the train speeding towards Headquarters.\n</p>", "902": "<p><b>Joy</b>: The train, of course! That is so much faster! But how do we catch it?\n</p>", "903": "<p><b>Bing Bong</b>: Well, it kind of goes all over the place, but there is a station in Imaginationland. I know a short cut. Come on, this way!\n</p>", "904": "<p><b>Joy</b>: I’m so glad we ran into you!\n</p>", "905": "<p>[A giant BUILDING blocks their progress. Bing Bong opens a door. It’s dark inside.]\n</p>", "906": "<p><b>Bing Bong:</b> The station is right through here.\n</p>", "907": "<p>[The train station is visible through a door on the other side.]\n</p>", "908": "<p><b>Bing Bong:</b> After you.\n</p>", "909": "<p><b>Sadness</b>: Joy...\n</p>", "910": "<p><b>Joy</b>: What?\n</p>", "911": "<p><b>Sadness</b>: I read about this place in the manual. We shouldn’t go in there.\n</p>", "912": "<p><b>Joy</b>: Bing Bong says it’s the quickest way to Headquarters.\n</p>", "913": "<p><b>Sadness</b>: No, but Joy, this is Abstract Thought.\n</p>", "914": "<p><b>Bing Bong</b>: What’re you talking about? I go in here all the time. It’s a shortcut, see?\n</p>", "915": "<p>He points to a “Danger” sign above the door.\n</p>", "916": "<p><b>Bing Bong:</b> D-A-N-G-E-R: shortcut. I’ll prove it to you. (he climbs in) Look at me! I’m closer to the station ‘cause I’m taking the shortcut!\n</p>", "917": "<p><b>Sadness</b>: Let’s go around. This way.\n</p>", "918": "<p>She points: the building is huge -- it’s a long way around.\n</p>", "919": "<p><b>Bing Bong</b>: Almost there...!\n</p>", "920": "<p>[Joy looks back at Bing Bong. The station is right there.]\n</p>", "921": "<p><b>Joy</b>: (to Sadness) If you want to walk the long way, go for it. But Riley needs to be happy. I‘m not missing that train. (walks in) Bing Bong knows what he’s doing. He's part dolphin. They're very smart.\n</p>", "922": "<p><b>Sadness</b>: Well, I guess...\n</p>", "923": "<p>[She climbs in.]\n</p>", "924": "<p>OK, what abstract concept are we trying to comprehend today?\n</p>", "925": "<p>Ahm, loneliness.\n</p>", "926": "<p>Hm, looks like there's something in there. I'm gonna turn it on for a minute and burn out the gunk.\n</p>", "927": "<p><b>Bing Bong:</b> What did I tell ya? You'll be in Headquarters in no time! Hey, will you look at that?\n</p>", "928": "<p><b>Joy:</b> Woah! What's happening?\n</p>", "929": "<p><b>Sadness:</b> Oh no, they turned it on.\n</p>", "930": "<p><i><b>Bing Bong</b>:</i>Huh? <i>(His head changes into a picasso-like form)</i> Never seen this before.\n</p>", "931": "<p><b>Both</b>: Aahh! <i>(They change too)</i> AAAAHHH!!!\n</p>", "932": "<p><b>Bing Bong:</b> My face! My beautiful face! <i>(His body changes)</i>\n</p>", "933": "<p><b>Joy:</b> What is going on?\n</p>", "934": "<p><b>Sadness:</b> We're abstracting! There are four stages. This is the first: Non-objective fragmentation!\n</p>", "935": "<p><b>Bing Bong:</b> Alright, do not panic! What is important is that we all stay together. <i>(His arm falls off)</i> Oh!\n</p>", "936": "<p><b>Joy:</b> Ah!\n</p>", "937": "<p>[Joy's head falls off followed by Sadness who topples.]\n</p>", "938": "<p><b>Sadness:</b> We're in the second stage, we’re deconstructing!\n</p>", "939": "<p><b>Bing Bong:</b> Run! [falls into pieces] Ah, I can't feel my legs! Oh, there they are.\n</p>", "940": "<p><b>Joy:</b> Come here, me!\n</p>", "941": "<p>[They gather their pieces as they rush to the exit.]\n</p>", "942": "<p><b>Sadness:</b> We gotta get outta here, OW! Before we're nothing but shape and color! OW! We'll get stuck here forever!\n</p>", "943": "<p><b>Joy:</b> \"Stuck?!\" Why did we come in here?\n</p>", "944": "<p><b>Bing Bong:</b> I told you, it's a shortcut!\n</p>", "945": "<p><b>Joy:</b> The Train!\n</p>", "946": "<p><i>(The view squeezes out to black; when it squeezes back in, now everything has become 2D-flash animated with Joy, Sadness, and Bing Bong as flat shapes.)</i>\n</p>", "947": "<p><b>Sadness:</b> Oh no, we're two dimensional! That's stage three!\n</p>", "948": "<p><b>Joy:</b> We're getting nowhere!\n</p>", "949": "<p><b>Bing Bong:</b> Depth! I'm lacking depth!\n</p>", "950": "<p><b>Joy:</b> Come on! We can't fit!\n</p>", "951": "<p><i>(He suddenly changes into a single spiral representation; Joy turns into a starburst. Bing Bong into a cone and Sadness turns into a raindrop, as everything but the door vanishes.)</i>\n</p>", "952": "<p><b>Sadness:</b> Oh no, we're non-figurative! This is the last stage!\n</p>", "953": "<p><b>Bing Bong:</b> We're not gonna make it!\n</p>", "954": "<p><i>(She flops on the ground; suddenly, the side of her shape is revealed to be just a line.)</i>\n</p>", "955": "<p><b>Sadness:</b> Wait, we're two dimensional. Fall on your face!\n</p>", "956": "<p>[The three lines land outside just as the train pulls out. They get up to go, but as lines they can barely move.]\n</p>", "957": "<p><b>Joy</b>: Stop! STOP!\n</p>", "958": "<p>[Joy goes from non-representational to two-dimensional. She falls down flat as the train speeds off. POP! The three transform back to normal.]\n</p>", "959": "<p><b>Joy:</b> (to Bing Bong) Oh no! You said that was a shortcut.\n</p>", "960": "<p><b>Bing Bong:</b> I did, but wow, we should NOT have gone in there. That was dangerous! They really should put up a sign.\n</p>", "961": "<p><b>Joy:</b> How long till the next train?\n</p>", "962": "<p><b>Bing Bong:</b> Who knows? But don’t worry. There’s another station. That way! The train always stops there right before it goes to Headquarters. If we hurry, we can catch it!\n</p>", "963": "<p><b>Joy:</b> This isn’t another one of your short cuts, is it?\n</p>", "964": "<p><b>Bing Bong</b>: (laughing exuberantly) Yeah!\n</p>", "965": "<p>[Joy skeptically watches him head off.] \n</p>", "966": "<p><b>Joy</b>: (to Sadness) Is there really another station?\n</p>", "967": "<p><b>Sadness</b>: Uh-huh. Through there.\n</p>", "968": "<p>Bing Bong leads them towards the impressive gates of...\n</p>", "969": "<p><b>Bing Bong:</b> Welcome to Imagination land!\n</p>", "970": "<p><b>Joy</b>: Imagination land?\n</p>", "971": "<p><b>Bing Bong:</b> Sure! I come here all the time. I’m practically the mayor. Hey, you guys hungry? There’s French Fry Forest! (starts eating) Nom nom nom, delicious!\n</p>", "972": "<p>[Joy is loving this.]\n</p>", "973": "<p><b>Joy</b>: No way!\n</p>", "974": "<p><b>Bing Bong</b>: Check it out! Trophy Town! Medals! Ribbons! Everyone’s a winner!\n</p>", "975": "<p>Bing Bong kicks a soccer ball into a giant goal and workers appear out of nowhere to shower him with awards.\n</p>", "976": "<p><b>Bing Bong</b>: I won first place!\n</p>", "977": "<p>[Workers give Joy a medal and Sadness a ribbon.]\n</p>", "978": "<p><b>Joy</b>: Me too!\n</p>", "979": "<p><b>Sadness</b>: Hohh... Participation award...\n</p>", "980": "<p><b>Joy</b>: Wait, is that-- Sadness, look, it’s Cloud Town! That is my favorite!\n</p>", "981": "<p>Joy rips off a chunk of cloud and floats up into the air.\n</p>", "982": "<p><b>Joy</b>: (CONT’D) It's so soft!\n</p>", "983": "<p>Joy jumps down and runs off.\n</p>", "984": "<p><b>Bing Bong</b>: Woah! Let me try!\n</p>", "985": "<p>Bing Bong rips off some cloud. A CLOUD MAN emerges from the house, angry.\n</p>", "986": "<p><b>Cloud man:</b> Hey! What’s the big idea? You’d better fix that wall, or else you’re in big troub--\n</p>", "987": "<p>POOF! Bing Bong blows the Cloud Man away and walks off nervously.\n</p>", "988": "<p>Joy and Bing Bong gleefully jump between couch cushions.\n</p>", "989": "<p><b>Joy</b>: Oh no, lava! Whooo!\n</p>", "990": "<p><b>Bing Bong:</b> Whawhoooo! Imagination land is the best!\n</p>", "991": "<p>Sadness tries to jump to a rock, barely makes it.\n</p>", "992": "<p><b>Sadness</b>:  Is it all going to be so interactive?\n</p>", "993": "<p><b>Bing Bong:</b> Hey, look! The House of Cards!! Ooh, wait, hang on just a minute...\n</p>", "994": "<p>From a nearby garage made of cards, Bing Bong pulls a wagon.\n</p>", "995": "<p><b>Joy</b>: Your rocket!\n</p>", "996": "<p><b>Bing Bong</b>: Yeah! I stashed it in there for safekeeping. Now I’m all set to take Riley to the MOON!\n</p>", "997": "<p>He gestures proudly -- accidentally knocking over the house.\n</p>", "998": "<p><b>Bing Bong:</b>(CONT’D) Oh, I’m sorry.\n</p>", "999": "<p><b>Worker</b>: Great.\n</p>", "1000": "<p><b>Joy</b>: I love Imagination land!\n</p>", "1001": "<p><b>Bing Bong:</b> Isn’t it great? And there’s always something new, like...\n</p>", "1002": "<p>A giant machine. A conveyer belt reveals a handsome teenager.\n</p>", "1003": "<p><b>Bing Bong:</b> (CONT’D) Who the heck is that?\n</p>", "1004": "<p><b>Worker</b>: Imaginary Boyfriend.\n</p>", "1005": "<p><b>Imaginary boyfriend</b>: I would die for Riley.\n</p>", "1006": "<p>[Joy grimaces.]\n</p>", "1007": "<p><b>Bing Bong:</b> I’ve never seen him before.\n</p>", "1008": "<p><b>Imaginary boyfriend</b>: I live in Canada.\n</p>", "1009": "<p><b>Bing Bong</b>: Anyway. This way, through Preschool World! We’re nearly to the train!\n</p>", "1010": "<p><b>Joy</b>: Riley, here we come!\n</p>", "1011": "<p>Mom and Riley sit on the bleachers. \n</p>", "1012": "<p>Mrs. Andersen: This should be fun. New team, new friends! These kids look pretty good -- considering they're from San Francisco. Heh heh! \n</p>", "1013": "<p>HOCKEY COACH (O.S.) Okay Andersen, you're up! \n</p>", "1014": "<p>RILEY I gotta go. \n</p>", "1015": "<p>Riley heads onto the ice. \n</p>", "1016": "<p>Mrs. Andersen: Okay. Good luck, sweetie! \n</p>", "1017": "<p><b>Disgust</b>: Luck isn’t gonna help us now. If she tries to use Hockey Island, it’s going down. \n</p>", "1018": "<p><b>Fear</b>: Which is why I’ve recalled every hockey memory I can think of. \n</p>", "1019": "<p>The Emotions are standing ankle deep in memories.\n</p>", "1020": "<p><b>Fear</b> (CONT’D) One of these has got to work in place of the core memory.  \n</p>", "1021": "<p><b>Both</b>:  She’s about to play!/Hurry! \n</p>", "1022": "<p>Fear loads a memory into the core holder.\n</p>", "1023": "<p>Riley skates onto the ice. INT. HEADQUARTERS Out the window, Hockey Island lights up feebly. \n</p>", "1024": "<p><b>Fear</b>: Ha ha! We did it gang! It’s working--\n</p>", "1025": "<p>[BOOM! The Core Memory Holder ejects a memory, slamming Anger in the face. Hockey Island shakes. Fear SHRIEKS.  Riley struggles to dribble the puck.] \n</p>", "1026": "<p>HOCKEY COACH Line change! Line change! Change it up! Change it up! \n</p>", "1027": "<p>[Fear frantically loads memories into the Holder, which spits them out like dodge balls. Disgust and Anger run for cover. The Holder spins furiously, flinging Fear against the window. Memories pelt him.]\n</p>", "1028": "<p><b>Disgust</b>: (hiding behind a sofa) It’s like we don't learn anything. \n</p>", "1029": "<p>HOCKEY COACH Let’s pick it up out there! \n</p>", "1030": "<p>[Riley attempts to slap the puck, misses, and TRIPS.]\n</p>", "1031": "<p><b>Anger:</b> That’s it! \n</p>", "1032": "<p><b>Fear:</b> No, no, no, breathe! Find your happy place--\n</p>", "1033": "<p>[Anger grabs Fear by the neck and ricochets him off the console, then furiously takes the controls. Riley angrily throws her stick to the ice and skates off. The other players stop and watch.]\n</p>", "1034": "<p><b>Mrs. Andersen:</b> Riley, what's wrong?\n</p>", "1035": "<p><b>Riley:</b> Let's go.\n</p>", "1036": "<p><b>Mrs. Andersen:</b> You're not going to finish tryouts?\n</p>", "1037": "<p><b>Riley:</b> What's the point?!\n</p>", "1038": "<p><b>Mrs. Andersen:</b> Hey, it'll be alright. Let's just go back...\n</p>", "1039": "<p><b>Riley:</b> <i><b>Stop saying everything will be alright!!!</b></i>\n</p>", "1040": "<p>Nice hustling, ladies!\n</p>", "1041": "<p>[Joy turns around and watches Hockey Island crumble.]\n</p>", "1042": "<p><b>Joy:</b> Hockey? Oh no... no, she loves hockey. She can’t give up hockey. \n</p>", "1043": "<p>[She pulls out the Hocky core memory]\n</p>", "1044": "<p><b>Joy:</b> Bing Bong, we have to get to that station.\n</p>", "1045": "<p><b>Bing Bong</b>: Sure thing. This way, just past Graham Cracker Castle. Hey. That’s weird. Graham Cracker Castle used to be right here. I wonder why they moved it?\n</p>", "1046": "<p>[He walks on, concerned, LEAVING HIS WAGON BEHIND HIM.]\n</p>", "1047": "<p><b>Bing Bong:</b> Wow, that’s not... I would have sworn Sparkle Pony Mountain was right here. Hey, what’s going on?\n</p>", "1048": "<p><b>Joy:</b> Yeah, yeah, I dunno, we’ll have to come back--\n</p>", "1049": "<p><b>Bing Bong:</b> Princess Dream World!\n</p>", "1050": "<p>[A wrecking ball hits a pink castle. Glitter dust plumes.]\n</p>", "1051": "<p><b>Bing Bong:</b>  Oh no! The Stuffed Animal Hall of Fame!\n</p>", "1052": "<p>[RIIIP! The head of a bear comes off. Too late, Bing Bong notices some construction workers CARRYING AWAY HIS ROCKET.]\n</p>", "1053": "<p><b>Bing Bong:</b> My rocket! (running after them) Wait! Riley and I, we’re still using that rocket! It still has some song power left!! (sings) Who's your friend who likes to play?\n</p>", "1054": "<p>THE ROCKET RESPONDS weakly, propelling it forward. The workers toss it onto a junk pile. A bulldozer pushes the pile towards the CLIFF EDGE.\n</p>", "1055": "<p><b>Bing Bong:</b> Nooo!!! No! No! No! You can’t take my rocket to the dump! Riley and I are going to the MOON! Ahhh!\n</p>", "1056": "<p>Over it goes, into the darkness.\n</p>", "1057": "<p><b>Bing Bong</b>: Riley can’t be done with me.\n</p>", "1058": "<p>[Bing Bong sits, stunned. Joy approaches gingerly.]\n</p>", "1059": "<p><b>Joy:</b> Hey, it’s going to be okay. We can fix this! We just need to get back to Headquarters. Which way to the train station?\n</p>", "1060": "<p><b>Bing Bong</b>: (still stunned) I had a whole trip planned for us.\n</p>", "1061": "<p>Joy tries another tactic.\n</p>", "1062": "<p><b>Joy</b>: Hey, who’s ticklish, huh? Here comes the tickle monster...\n</p>", "1063": "<p>No response.\n</p>", "1064": "<p><b>Joy</b>: (CONT’D) Hey! Bing Bong, look at this! Dohoioih!\n</p>", "1065": "<p>She makes a silly face. Nothing.\n</p>", "1066": "<p><b>Joy</b>:  Oh, here’s a fun game! You point to the train station and we all go there! Won’t that be fun? Come on, let’s go to the train station!\n</p>", "1067": "<p>[Joy walks off, attempting to lead.]\n</p>", "1068": "<p><b>Sadness</b>: (sits beside Bing Bong) I’m sorry they took your rocket. They took something that you loved. It’s gone, forever.\n</p>", "1069": "<p><b>Joy</b>: Sadness, don’t make him feel worse.\n</p>", "1070": "<p><b>Sadness</b>: Sorry.\n</p>", "1071": "<p><b>Bing Bong:</b>  It’s all I had left of Riley.\n</p>", "1072": "<p><b>Sadness</b>:  I bet you and Riley had great adventures.\n</p>", "1073": "<p><b>Bing Bong:</b> They were wonderful. Once we flew back in time. We had breakfast twice that day.\n</p>", "1074": "<p><b>Sadness</b>: That’s sounds amazing. I bet Riley liked it.\n</p>", "1075": "<p><b>Bing Bong</b>: Oh, she did. We were best friends.\n</p>", "1076": "<p><b>Sadness</b>: Yeah. It’s sad.\n</p>", "1077": "<p>[Bing Bong puts his head on Sadness’ shoulder and CRIES. Sadness keeps her arm around him until he’s done.]\n</p>", "1078": "<p><b>Bing Bong:</b> I’m okay now. (stands) C’mon, the train station is this way.\n</p>", "1079": "<p>He walks off. Joy and Sadness follow.\n</p>", "1080": "<p><b>Joy</b>: How did you do that?\n</p>", "1081": "<p><b>Sadness</b>: I don’t know. He was sad, so I listened to what--\n</p>", "1082": "<p><b>Bing Bong:</b> (O.S.) Hey, there’s the train!\n</p>", "1083": "<p>[Our trio climb aboard just as the train moves.]\n</p>", "1084": "<p><b>Joy</b>: We made it! We’re finally going to get home!\n</p>", "1085": "<p>[Twirling, she knocks over two boxes labeled “FACTS” and “OPINIONS.” Small objects spill out of both.]\n</p>", "1086": "<p><b>Joy</b>:  Oh no! These Facts and Opinions look so similar!\n</p>", "1087": "<p>He dumps them into the “FACTS” box.\n</p>", "1088": "<p><b>Bing Bong:</b> Eh, don’t worry about it -- happens all the time.\n</p>", "1089": "<p>[In headquarters]\n</p>", "1090": "<p><b>Disgust:</b>  On a scale of one to ten, I give this day an F.\n</p>", "1091": "<p><b>Anger</b>: Well why don’t we quit standing around and DO something?\n</p>", "1092": "<p><b>Disgust</b>: Like what, genius?\n</p>", "1093": "<p>[Fear enters with a suitcase.]\n</p>", "1094": "<p><b>Fear:</b> Like quitting! That’s what I’m doing.\n</p>", "1095": "<p>He stomps on the recall button.\n</p>", "1096": "<p><b>Fear:</b> (CONT’D) Sure, it’s the coward’s way out. But this coward is gonna survive!\n</p>", "1097": "<p>[The tube drops over him, but pummels Fear with dozens of memories. The tube shuts off and retracts. Fear drops to the floor in pain.]\n</p>", "1098": "<p><b>Disgust</b>: Emotions can’t quit, genius.\n</p>", "1099": "<p>Fear spits up a memory.\n</p>", "1100": "<p><b>Disgust:</b> (CONT’D) Euch! I thought we were supposed to be keeping Riley happy.\n</p>", "1101": "<p><b>Anger:</b> Wait a minute. Wait a minute!\n</p>", "1102": "<p>[Anger runs to the back and rummages the cubby through the ideas.]\n</p>", "1103": "<p><b>Fear:</b> What is it? \n</p>", "1104": "<p><b>Anger:</b> (holds up the lightbulb) Oh nothing. Just the best idea ever.\n</p>", "1105": "<p><b>Disgust:</b> What?\n</p>", "1106": "<p><b>Anger</b>: All the good core memories were made in Minnesota. Ergo, we go back to Minnesota and make more. Ta-da!\n</p>", "1107": "<p><b>Fear:</b>  Wait. You’re saying we run away?\n</p>", "1108": "<p><b>Anger:</b> Well, I wouldn’t call it that. I’d call it, “The Happy Core Memory Development Program.”\n</p>", "1109": "<p><b>Fear:</b>  You can’t be serious.\n</p>", "1110": "<p><b>Anger:</b> Hey. Our life was perfect until Mom and Dad decided to move to San Fran Stinktown.\n</p>", "1111": "<p><b>Fear:</b> But, I mean, it’s just so drastic!\n</p>", "1112": "<p><b>Anger:</b> Need I remind you of how great things were there? Our room? Our back yard? Our friends?\n</p>", "1113": "<p>He punches up a memory. It plays on the screen.\n</p>", "1114": "<p><b>Gum memory:</b> Tripledent gum will make you smile! Tripledent gum it lasts--\n</p>", "1115": "<p><b>Anger:</b> Did I ASK for the gum commercial?!?! (he ejects the memory) Anyway, it was better, that’s my point.\n</p>", "1116": "<p><b>Disgust</b> (considering) Riley was happier in Minnesota...\n</p>", "1117": "<p><b>Fear:</b> Wait, hold on. Shouldn’t we just sleep on this or something?\n</p>", "1118": "<p><b>Anger:</b> Fine. Let’s sleep on it. Because hey, I’m sure jolly fun-filled times are just around the corner.\n</p>", "1119": "<p>[As Joy, Sadness and Bing Bong are on their way to HQ, the train slows to a stop. Confused, Joy looked over as the engineer and his assistant hop off the engine.]\n</p>", "1120": "<p><b>Joy</b>: Hey! Why aren’t we moving?\n</p>", "1121": "<p><b>Train Engineer</b>: Riley’s gone to sleep. We’re all on break.\n</p>", "1122": "<p><b>Sadness</b>: You mean we’re stuck here until morning?\n</p>", "1123": "<p><b>Bing Bong</b>: Yeah, the Train of Thought doesn’t run while she’s asleep.\n</p>", "1124": "<p><b>Joy</b>: Oh, we can’t wait that long!\n</p>", "1125": "<p><b>Sadness</b>: How about we wake her up?\n</p>", "1126": "<p><b>Joy</b>: Sadness, that’s ridiculous. How could we possibly...\n</p>", "1127": "<p>[She follows Sadness’ gaze and spots DREAM PRODUCTIONS.]\n</p>", "1128": "<p><b>Joy</b>: How about we wake her up?\n</p>", "1129": "<p><b>Sadness</b>: Great idea, Joy.\n</p>", "1130": "<p><b>Joy</b>: Thanks. Come on!\n</p>", "1131": "<p>[Later, they arrived at Dream Productions.]\n</p>", "1132": "<p><b>Joy</b>: Whoa! This place is huge.\n</p>", "1133": "<p><b>Sadness</b>: Yeah, it looks so much smaller than I expected.\n</p>", "1134": "<p>[They walk past dream “movie posters.”]\n</p>", "1135": "<p><b>Bing Bong:</b>  Whoa! “I Can Fly”? I love that one!\n</p>", "1136": "<p>Joy spots a Unicorn sitting in a director’s chair.\n</p>", "1137": "<p><b>Joy</b>: Rainbow Unicorn! She’s RIGHT THERE!\n</p>", "1138": "<p>Joy tries to play it cool as they walk past.\n</p>", "1139": "<p><b>Sadness:</b> My friend says you’re famous. She wants your autograph.\n</p>", "1140": "<p><b>Joy:</b>  No, no, Sadness, don’t bother Miss Unicorn, okay? (to unicorn) Sorry, she’s from outta town. So embarrassing, right?\n</p>", "1141": "<p>She pushes Sadness away. Joy pops back in.\n</p>", "1142": "<p><b>Joy:</b> I loved you in Fairy Dream Adventure Part 7. Okay, bye. I love you.\n</p>", "1143": "<p>They reach STAGE B. A sign below a red flashing light reads, “DO NOT ENTER WHEN LIGHT FLASHING.” \n</p>", "1144": "<p><b>Bing Bong:</b> Huh. Wonder what that means. Oh well, let’s go in!\n</p>", "1145": "<p><b>Director</b>: Set up the classroom set. Today's memories are in. We've got a lot to work with here. Riley dumped her best friend, had a miserable day at school and quit hockey. The writers have put together a killer script.\n</p>", "1146": "<p><b>Fear:</b> Just because Joy and Sadness are gone, I have to do stupid dream duty.\n</p>", "1147": "<p><b>Joy</b>: Okay, how are we gonna wake her up?\n</p>", "1148": "<p><b>Sadness</b>: Well, she wakes up sometimes when she has a scary dream. We could scare her.\n</p>", "1149": "<p><b>Joy</b>: Scare her? No no, she’s been through enough already. \n</p>", "1150": "<p><b>Sadness:</b> But Joy-- \n</p>", "1151": "<p><b>Joy:</b> Sadness, you may know your way around down here, but I know Riley! We’re gonna make her so happy she’ll wake up with exhilaration! We’ll excite her awake! \n</p>", "1152": "<p><b>Sadness:</b> That’s never happened before. \n</p>", "1153": "<p>[Joy spots a nearby dog costume and tosses it to Sadness.] \n</p>", "1154": "<p><b>Joy:</b> Ooh, Riley loves dogs. Put this on! \n</p>", "1155": "<p><b>Sadness</b>: I don’t think that’ll work. \n</p>", "1156": "<p><b>Joy</b>: Bing Bong. \n</p>", "1157": "<p><b>Bing Bong</b>: Yeah? \n</p>", "1158": "<p>[She gives him the satchel containing the CORE MEMORIES.] \n</p>", "1159": "<p><b>Joy</b>: Don’t let anything happen to these. \n</p>", "1160": "<p><b>Bing Bong:</b> Got it! \n</p>", "1161": "<p>DREAM DIRECTOR checks the monitor. \n</p>", "1162": "<p><b>Dream Director:</b>  Mm hm. Add the reality distortion filter. \n</p>", "1163": "<p>A WORKER slips a filter over the camera lens, transforming the MIND WORKERS into replicates of Riley’s classmates. \n</p>", "1164": "<p><b>Dream Director:</b> (CONT’D) Love it. (to actors) Remember, play to the camera, everyone! Riley is the camera! Makeup, get out of there, we are on in 5,4,3... \n</p>", "1165": "<p>A UNION HARP PLAYER strums: the dream is starting. From the camera’s POV: the classroom set. STUDENTS at desks. An EXTRA playing Riley’s teacher reads cue cards badly. \n</p>", "1166": "<p><b>Extra</b>: Hello class. Before we begin today’s pop quiz, which counts for 90% of your final grade... \n</p>", "1167": "<p><b>Fear</b>: Man, she is one bad actress. \n</p>", "1168": "<p>The CUE CARD GUY flips over the next card. \n</p>", "1169": "<p><b>Extra:  .</b>..I want to introduce our new student. Riley. Would you like to stand up and introduce yourself? \n</p>", "1170": "<p><b>Dream Director:</b> Camera. \n</p>", "1171": "<p>[The camera adjusts as if Riley is standing.] \n</p>", "1172": "<p><b>Dream Director:</b> And... cue Riley.\n</p>", "1173": "<p>[A CREW MEMBER clears his throat and reads into a megaphone.]\n</p>", "1174": "<p><b>Riley Voice:</b>  My name’s Riley Andersen, I’m from Minnesota and now I live here. \n</p>", "1175": "<p>[A STUDENT points to the camera.] \n</p>", "1176": "<p><b>Student #1</b> Ew, look! Her teeth are falling out!\n</p>", "1177": "<p>[A crew member drops handfuls of teeth in front of the camera.] \n</p>", "1178": "<p><b>Fear:</b> (dismissive) Pff, teeth falling out, I'm used to that one. Let me guess, we have no pants on. \n</p>", "1179": "<p><b>Dream Student #2</b> Hey look! She came to school with no pants on! \n</p>", "1180": "<p>[The camera adjusts down to reveal Riley’s bare legs. Riley’s hands try to block them.] \n</p>", "1181": "<p><b>Fear:</b> Called it! \n</p>", "1182": "<p>[Joy and Sadness are in the dog costume, waiting to go on.] \n</p>", "1183": "<p><b>Joy:</b> Ready? \n</p>", "1184": "<p><b>Sadness:</b> [worried] I don’t think this happy thing is going to work. But if we scare her-- \n</p>", "1185": "<p><b>Joy:</b> Just follow my lead. Here we go! \n</p>", "1186": "<p>[Joy yanks Sadness onto the set. They run around in playful circles. Joy started barking.]\n</p>", "1187": "<p><b>Dream Director:</b>  (flipping through script) Who is that? \n</p>", "1188": "<p><b>Fear:</b> [confused] What’s going on?\n</p>", "1189": "<p>[Joy and Sadness run around, Joy licking students and barking. Through the reality distortion they look like a happy puppy. Joy looks at the sleep indicator: Riley is still asleep. ]\n</p>", "1190": "<p><b>Joy:</b> (to Bing Bong) Psst. You’re on! Go!\n</p>", "1191": "<p>[Bing Bong pulls a rope. Balloons drop! A colorful backdrop!]\n</p>", "1192": "<p><b>Joy:</b> Woo! Let’s party! Let’s dance. Woo! \n</p>", "1193": "<p><b>Fear:</b> Hey, a party! \n</p>", "1194": "<p><b>Sadness:</b> Joy, this isn’t working. \n</p>", "1195": "<p>[Bing Bong knocks over a light, causing spooky uplighting. Sadness tries to stop. The dog costume RIPS IN HALF. Fear spits out the tea he was drinking. On screen, a real dog is in two pieces.] \n</p>", "1196": "<p><b>Joy:</b> Huh? Sadness, what are you doing?! Come back here! \n</p>", "1197": "<p>[She starts chasing Sadness. On screen, the front half of a dog chases the rear half. ]\n</p>", "1198": "<p><b>Fear:</b> It’s just a dream, it’s just a dream, it’s just a dream... \n</p>", "1199": "<p>[Riley stirs in her sleep.] \n</p>", "1200": "<p><b>Dream Director:</b> They’re trying to wake her up! Call security! \n</p>", "1201": "<p>[Bing Bong appears on screen.] \n</p>", "1202": "<p><b>Bing Bong:</b> (O.S.) Hi Riley, it’s me! Who’s your friend who likes to play? Bing Bong, Bing Bong!\n</p>", "1203": "<p><b>Fear:</b> [dumbstruck] Bing Bong? \n</p>", "1204": "<p>[Bing Bong slips, tipping over the set wall.] \n</p>", "1205": "<p><b>Joy:</b> Sadness! You are ruining this dream! You’re scaring her! \n</p>", "1206": "<p><b>Sadness</b> But look, it’s working! \n</p>", "1207": "<p>[The SLEEP INDICATOR is starting to tip. Joy’s eyes widen.] \n</p>", "1208": "<p><b>Joy:</b> Whoa! \n</p>", "1209": "<p>[But before she can do anything, Security enters.] \n</p>", "1210": "<p><b>Dream Director</b>: (to Security) They are not part of this dream! Get them! \n</p>", "1211": "<p>[Sadness pulls Joy out of harms way as guards GRAB Bing Bong.] \n</p>", "1212": "<p>DREAM PRODUCTIONS COP #1 Stop right there! \n</p>", "1213": "<p><b>Bing Bong:</b> Ow! Hey! \n</p>", "1214": "<p><b>Dream Director:</b> (to camera operator) Pan away! Pan away! \n</p>", "1215": "<p>[The camera pans away to Rainbow Unicorn making off with a giant cupcake platter from the craft services table. ]\n</p>", "1216": "<p><b>Fear:</b> Booooo! Pick a plot line!\n</p>", "1217": "<p>[Joy and Sadness watch as guards haul off Bing Bong and began to follow.]\n</p>", "1218": "<p><b>Bing Bong:</b> (O.S.) Ow! Ow! Cut that out. Ow! Please... you can’t do this! Do you like candy? You look hungry. I can get you candy! Please! Ow. Ow. Ow. \n</p>", "1219": "<p>[Joy and Sadness watch Bing Bong being dragged far off to the dark, menacing entry of SUBCONSCIOUS.] \n</p>", "1220": "<p><b>Joy</b>: No, no no no, there go the core memories...! \n</p>", "1221": "<p>[The door opens. SPOOKY LIGHT spills out.]\n</p>", "1222": "<p><b>Bing Bong:</b> I can’t go in there. I’m scared of the dark. Please! \n</p>", "1223": "<p>[He’s thrown in and the door SLAMS SHUT. Joy and Sadness head after him, down the long stairway.] \n</p>", "1224": "<p><b>Joy</b>: What is this place? \n</p>", "1225": "<p><b>Sadness</b>: (hushed tone) The Subconscious. It’s where they take all the troublemakers. \n</p>", "1226": "<p>[Joy and Sadness hide. TWO CLUELESS GUARDS block the gate.]\n</p>", "1227": "<p>SUBCONSCIOUS GUARD DAVE My hat feels loose. \n</p>", "1228": "<p>SUBCONSCIOUS GUARD FRANK Let me see. How to get in? \n</p>", "1229": "<p>Sadness has an idea. She leads Joy around and behind the guards. \n</p>", "1230": "<p>SUBCONSCIOUS GUARD DAVE You got my hat? Or, or is that your hat? \n</p>", "1231": "<p>SUBCONSCIOUS GUARD FRANK Yeah, it’s my hat. \n</p>", "1232": "<p>SUBCONSCIOUS GUARD DAVE You sure? I don’t know, look in the label. \n</p>", "1233": "<p>SUBCONSCIOUS GUARD FRANK Yeah, it says, “My Hat.” \n</p>", "1234": "<p>SUBCONSCIOUS GUARD DAVE Wait, it says, “My Hat”?\n</p>", "1235": "<p>SUBCONSCIOUS GUARD FRANK “My Hat,” it says. \n</p>", "1236": "<p>SUBCONSCIOUS GUARD DAVE That’s what I wrote in my hat. \n</p>", "1237": "<p>SUBCONSCIOUS GUARD FRANK What are you talking about? \n</p>", "1238": "<p>SUBCONSCIOUS GUARD DAVE You’ve got my hat on. \n</p>", "1239": "<p>SUBCONSCIOUS GUARD FRANK Okay, but it’s my handwriting-- \n</p>", "1240": "<p>Sadness loudly SHAKES the door.\n</p>", "1241": "<p>SUBCONSCIOUS GUARD DAVE Hey! You! \n</p>", "1242": "<p>Sadness: Oh! You caught us! Heh. \n</p>", "1243": "<p>SUBCONSCIOUS GUARD FRANK Get back in there! No escaping! \n</p>", "1244": "<p>The guards shove them through and slam the door. Joy gives Sadness an approving nod: nice work. They head forward. This place is spooky. \n</p>", "1245": "<p>Sadness: I don’t like it here. It’s where they keep Riley’s darkest fears. \n</p>", "1246": "<p>[Joy spots a dark shape ahead:] \n</p>", "1247": "<p>Joy: It’s broccoli! \n</p>", "1248": "<p>[Behind them:]\n</p>", "1249": "<p>Sadness: The stairs to the basement! \n</p>", "1250": "<p>[They SCAMPER AWAY like frightened mice.] \n</p>", "1251": "<p>Joy: Grandma’s vacuum cleaner!\n</p>", "1252": "<p>[The vacuum gives chase. Joy and Sadness lose it and hide behind a rock.] \n</p>", "1253": "<p>Joy: (catching her breath) Okay, come on.\n</p>", "1254": "<p>[Sadness makes a loud CRINKLING NOISE with each step.] \n</p>", "1255": "<p>Joy:  Would you walk quieter? \n</p>", "1256": "<p>Sadness: I’m trying! \n</p>", "1257": "<p>Joy What is going-- (looking down) Candy wrappers. \n</p>", "1258": "<p>They follow a trail of candy wrappers into the cave to find a crying Bing Bong in a balloon cage, atop a large mound. \n</p>", "1259": "<p>Joy: Bing Bong! \n</p>", "1260": "<p>Bing Bong: Joy? \n</p>", "1261": "<p><b>Joy</b>: There you are. \n</p>", "1262": "<p>[The imaginary friend shushes and points. They are standing in front of a giant SLEEPING CLOWN,]\n</p>", "1263": "<p><b>Joy:</b> (terrified) It’s Jangles.\n</p>", "1264": "<p>[They gingerly approach Jangles. Joy climbs up to Bing Bong.] \n</p>", "1265": "<p><b>Joy</b>: Do you have the core memories? \n</p>", "1266": "<p>He gives her the satchel. Joy holds them close. \n</p>", "1267": "<p><b>Bing Bong:</b> All he cared about was the candy.\n</p>", "1268": "<p>[Joy helps Bing Bong squeeze through, but the balloon-bars make loud twisting noises. Jangles stirs. Joy freezes. She stretches them further... Success! Joy and Bing Bong hurry down and the trio rush away.] \n</p>", "1269": "<p><b>Bing Bong</b>:(CONT’D) We’re out of here! Let’s get to that train. \n</p>", "1270": "<p><b>Joy</b>: Wait. The train’s not running. We still have to wake up Riley. \n</p>", "1271": "<p><b>Sadness</b>: But how? \n</p>", "1272": "<p>[Joy and Sadness look back at the clown.] \n</p>", "1273": "<p><b>Bing Bong:</b> Oh no. \n</p>", "1274": "<p>[Together, Joy and Sadness approach Jangles and HONK HIS NOSE. His eyes open. He stands. He’s HUGE, towering over them.] \n</p>", "1275": "<p><b>Joy</b>: (loudly) H-hhey Sadness, did you hear about the p-pahh-party that we’re having?\n</p>", "1276": "<p><b>Sadness</b>: Ohhhh yeah, yes Joy! Isn’t it a babahh... birthday party? \n</p>", "1277": "<p>Jangles: Did you say... birthday? \n</p>", "1278": "<p>Joy: And there’s going to be cake, and presents and-- \n</p>", "1279": "<p>Sadness:  --and games and balloons-- \n</p>", "1280": "<p>Jangles: (pulls out a giant mallet) A BIRTHDAY?!?! \n</p>", "1281": "<p>Joy: Okay. Follow us! \n</p>", "1282": "<p>All three run towards the gate, followed by the giant clown! \n</p>", "1283": "<p>Joy:  Nothing like a good scare to wake you up, right? \n</p>", "1284": "<p>The guards inspect each others’ hats. \n</p>", "1285": "<p>SUBCONSCIOUS GUARD FRANK Okay, but it’s my handwriting. \n</p>", "1286": "<p>SUBCONSCIOUS GUARD DAVE No, it isn’t. That’s my handwrit-- I wrote that!\n</p>", "1287": "<p>SUBCONSCIOUS GUARD FRANK No, but THIS one’s my handwriting-- \n</p>", "1288": "<p>BASH! Jangles’ mallet smashes through, laughing maniacally. Our trio run up the stairs, Jangles close behind.  The UNICORN DREAM is mid-production: a Glitter Dance Party, rainbows and sparkles aplenty. The crew is bored, even Fear in HQ. he set begins to shake. BLAAAM! Jangles crashes in.\n</p>", "1289": "<p>Jangles: WHO’S THE BIRTHDAY GIRL?!?! \n</p>", "1290": "<p>[Fear SHRIEKS, bashes a button and passes out  Riley bolts upright in bed.  The meter reads “AWAKE.” Joy and Sadness do a happy dance.]\n</p>", "1291": "<p><b>Bing Bong:</b> Come on, let’s go! \n</p>", "1292": "<p>[They bolt, leaving Jangles gleefully demolishing the sets. Our trio leap aboard just as the train picks up speed.] \n</p>", "1293": "<p><b>Joy</b>: Ha ha! We made it! \n</p>", "1294": "<p><b>Sadness</b>: Whoo-hoo! Ha ha! \n</p>", "1295": "<p><b>Joy</b>: Guess who’s on their way to Headquarters?! \n</p>", "1296": "<p>Joy grabs Sadness and picks her up in celebration. \n</p>", "1297": "<p><b>Sadness</b>: We are!\n</p>", "1298": "<p><b>Disgust:</b> What is going on?\n</p>", "1299": "<p><b>Anger:</b> He did it again. \n</p>", "1300": "<p><b>Fear:</b> We were at school and we were naked, and there was a dog... The back half was... was chasing it... It was Bing Bong.\n</p>", "1301": "<p><b>Anger:</b> You idiot! It was a dream! This is ridiculous. We can't even get a good night sleep anymore!\n</p>", "1302": "<p><i>(He takes out the idea bulb from before.)</i>\n</p>", "1303": "<p><b>Anger:</b> Time to take action. Stupid Mom and Dad, if they hadn't moved us, none of this would have happened. Who's with me?\n</p>", "1304": "<p><b>Fear:</b> Oh, uh... no no no no no no.\n</p>", "1305": "<p><b>Disgust:</b> Yeah, let's do it.\n</p>", "1306": "<p><i>(Anger inserts the bulb into the console; it screws in and lights up with a chime. Outside, Riley gets the idea and takes out her laptop. The bulb then sinks into the console.)</i>\n</p>", "1307": "<p><b>Anger:</b> She took it. There's no turning back.\n</p>", "1308": "<p><b>Disgust:</b> So, how are we going to get to Minnesota from here?\n</p>", "1309": "<p><b>Anger:</b> Well, why don't we go down to the elephant lot and rent an elephant?\n</p>", "1310": "<p><b>Fear:</b> Hey, that sounds nice!\n</p>", "1311": "<p><b>Anger:</b> We're taking the bus, nitwit!\n</p>", "1312": "<p><i>(Riley pulls up the Transway Bus Lines website, setting up a one-way travel from San Francisco to Minneapolis, departing the very next day.)</i>\n</p>", "1313": "<p><b>Anger:</b> There's a bus leaving tomorrow. Perfect!\n</p>", "1314": "<p><b>Disgust:</b> A ticket costs money. How do we get money?\n</p>", "1315": "<p><b>Anger:</b> Mom's purse.\n</p>", "1316": "<p><b>Disgust:</b> Oh, you wouldn't!\n</p>", "1317": "<p><b>Anger:</b> Oh, but I would. Where was it we saw it last?\n</p>", "1318": "<p>[He punches up a memory. It comes up and plays.]\n</p>", "1319": "<p>♪ Tripledent gum...\n</p>", "1320": "<p><b>Anger:</b> <i><b>NO!</b></i> [slams controls]\n</p>", "1321": "<p><b>Fear:</b> Aah!\n</p>", "1322": "<p><b>Anger:</b> It's downstairs somewhere. Mom and Dad got us into this mess, they can pay to get us out.\n</p>", "1323": "<p>[The train speeds ahead. The trio look out the train door.]\n</p>", "1324": "<p><b>Bing Bong</b>: How about this, huh? Isn’t this nice? You can see everything from up here! Look, there's Inductive Reasoning. There's Deja Vu. There's Language Processing! There's Deja Vu. There's Critical Thinking! There's Deja Vu. Hey look at this, guys! Memories! \n</p>", "1325": "<p>[Bing Bong ducks inside the train. Joy looks over to Sadness.] \n</p>", "1326": "<p><b>Joy:</b> Hey, that was a good idea. About scaring Riley awake. You’re not so bad. \n</p>", "1327": "<p><b>Sadness</b>: Really? \n</p>", "1328": "<p><b>Joy</b>:  Nice work.\n</p>", "1329": "<p>[Joy turns to sit on a crate inside the train.] \n</p>", "1330": "<p><b>Joy:</b> I can’t wait to get the old Riley back. As soon as we get there I’m going to fix this whole mess. \n</p>", "1331": "<p>[Bing Bong looks at a memory.  Inside there was Riley hoisted in the air by her teammates.]\n</p>", "1332": "<p><b>Bing Bong:</b> Whoa. Is this Riley?  She’s so big now. She won’t fit in my rocket. How’re we gonna get to the moon? \n</p>", "1333": "<p><b>Joy</b> (taking the memory) Oh, it's that time in the twisty tree, remember? The hockey team showed up and Mom and Dad were there cheering. Look at her, having fun and laughing. I love this one. \n</p>", "1334": "<p><b>Sadness</b>:  I love that one too. \n</p>", "1335": "<p><b>Joy:</b> Atta girl! Now you’re getting it! \n</p>", "1336": "<p><b>Sadness:</b> Yeah. It was the day the Prairie Dogs lost the big playoff game. Riley missed the winning shot. She felt awful. She wanted to quit. \n</p>", "1337": "<p>[Joy’s smile fades.] \n</p>", "1338": "<p><b>Sadness:</b> Sorry. I went sad again, didn’t I? \n</p>", "1339": "<p><b>Joy</b>: I’ll tell ya what. We’ll keep working on that when we get back. Okay?\n</p>", "1340": "<p><b>Sadness</b>: Okay. \n</p>", "1341": "<p>[Joy puts the memory in the satchel.]\n</p>", "1342": "<p><i>(Downstairs at the Andersen house, Mrs. Andersen is on the phone with the moving company; Riley sneaks downstairs.)</i>\n</p>", "1343": "<p><b>Mrs. Andersen:</b> I just don't understand.\n</p>", "1344": "<p><i>(From atop the staircase, Riley watches; Mrs. Andersen walks out of view, leaving her purse on the table.)</i>\n</p>", "1345": "<p><b>Mrs. Andersen:</b> Why did our moving van even go to Texas?\n</p>", "1346": "<p><i>(Once the coast is clear, Riley makes her move and approaches the purse.)</i>\n</p>", "1347": "<p><b>Mrs. Andersen:</b> Multiple customers?\n</p>", "1348": "<p><i>(Riley takes the purse and opens it.)</i>\n</p>", "1349": "<p><b>Mrs. Andersen:</b> Well, we were promised delivery on the 5th.\n</p>", "1350": "<p><i>(Riley gets out the wallet, opens it, and takes out Mrs. Andersen's credit card. Suddenly, Mrs. Andersen turns around.)</i>\n</p>", "1351": "<p><b>Mrs. Andersen:</b> Uh-huh.\n</p>", "1352": "<p><i>(Riley gets nervous; Mrs. Andersen looks up...and Riley has vanished.)</i>\n</p>", "1353": "<p><b>Mrs. Andersen:</b> Excuse me, isn't there any way that you can rush it?\n</p>", "1354": "<p><i>(Riley makes it back upstairs, unnoticed and credit card in hand to pay for the bus ticket. Her act of dishonesty causes Honesty Island to crumble and collapse; the Train of Thought passes by allowing Joy to notice.)</i>\n</p>", "1355": "<p><b>Joy:</b> Honesty Island?\n</p>", "1356": "<p>[Honesty Island crashes into the train tracks. Joy, Sadness and Bing Bong scream. Workers below see the train falling towards them.] \n</p>", "1357": "<p><b>Worker #1:</b> LOOK OUT! \n</p>", "1358": "<p>[The train CRASHES onto the cliffside. It slips towards the edge. Joy struggles to get up, but the floor is pitching.] \n</p>", "1359": "<p><b>Bing Bong:</b> Hold on! \n</p>", "1360": "<p>[Workers grab Joy, Sadness and Bing Bong just as the train slides off the cliff and drops into the dump below. Joy looks towards Headquarters.]\n</p>", "1361": "<p><b>Joy:</b> That was our way home. We lost another island. What is happening?\n</p>", "1362": "<p><b>Mind Worker:</b> Haven't you heard? Riley's running away.\n</p>", "1363": "<p><b>Joy:</b> What?\n</p>", "1364": "<p><i>(It is the next morning; Riley is packing her things to run away. Soon Fear takes command, and she hesitates.)</i>\n</p>", "1365": "<p><b>Fear:</b> Wait, wait! Hang on, guys. Are we really doing this? This is serious.\n</p>", "1366": "<p><b>Anger:</b> Look, we have no core memories.\n</p>", "1367": "<p><i>(Anger takes command.)</i>\n</p>", "1368": "<p><b>Anger:</b> You want Riley to be happy? Let's get back to Minnesota and make more.\n</p>", "1369": "<p><i>(With firm resolve, Riley finishes packing and zips her backpack.)</i>\n</p>", "1370": "<p><b>Sadness:</b> Joy, if we hurry, we can still stop her.\n</p>", "1371": "<p><i>(Joy looks toward the last remaining island, soon-to-be gone for good if they don't act up.)</i>\n</p>", "1372": "<p><b>Joy:</b> Family Island. Let's go!\n</p>", "1373": "<p><i>(They all rush towards the island, no time to lose. By now, Riley is coming downstairs; this causes Family Island to shake.)</i>\n</p>", "1374": "<p><b>Sadness:</b> Joy! Joy, it's too dangerous, we won't make it in time.\n</p>", "1375": "<p><b>Joy</b>: But, that's our only way back.\n</p>", "1376": "<p>[The rumbling causes an END CAP of a nearby shelf to break, exposing an open tube. A memory gets sucked up and shot towards Headquarters.]\n</p>", "1377": "<p><b>Joy:</b> A recall tube!\n</p>", "1378": "<p><b>Sadness:</b> We can get recalled! \n</p>", "1379": "<p>[They run towards it. ]\n</p>", "1380": "<p>Riley goes to the front door. Mom and Dad are in the kitchen. \n</p>", "1381": "<p><b>Mrs. Andersen:</b>  Have a great day, sweetheart. \n</p>", "1382": "<p><b>Mr. Andersen:</b> See you after school, monkey. \n</p>", "1383": "<p><b>Mrs. Andersen</b>: We love you! \n</p>", "1384": "<p>Riley doesn’t respond. She turns and walks out the door.\n</p>", "1385": "<p>Family Island rumbles. A LARGE CHUNK of cliff edge breaks off behind them, driving Joy and Sadness forward. \n</p>", "1386": "<p><b>Joy:</b> Go! Run! RUN! \n</p>", "1387": "<p>[Joy steps into the disconnected tube, ready to sail up to Headquarters. Sadness tries to climb in, but there’s not enough room; she jostles, pressing against the satchel. The CORE MEMORIES start to turn blue.] \n</p>", "1388": "<p><b>Joy:</b>  Woah woah! Sadness! (pushing her back) Sadness, stop! You’re hurting Riley! \n</p>", "1389": "<p>[Joy pulls a core memory from the satchel. It is bright blue, but slowly fades back to normal.] \n</p>", "1390": "<p><b>Sadness:</b> Oh no, I did it again... \n</p>", "1391": "<p><b>Joy:</b> If you get in here, these core memories will get sad!\n</p>", "1392": "<p>[Joy watches FAMILY ISLAND crumble. She looks down at Sadness. Joy, pained, decides.] \n</p>", "1393": "<p><b>Joy:</b> I’m sorry. Riley needs to be happy. \n</p>", "1394": "<p><b>Sadness:</b> Joy? \n</p>", "1395": "<p>[She pulls the tube closed and starts up alone. Sadness and Bing Bong watch, betrayed and despondent. Joy looks guilt-ridden, but looks on towards Headquarters. Suddenly, the cliffside rumbles. Joy’s tube BREAKS. Joy FALLS!] \n</p>", "1396": "<p><b>Bing Bong:</b> Joy!\n</p>", "1397": "<p>[Bing Bong runs forward to help her, but the ground beneath him crumbles away. Joy and Bing Bong tumble into the abyss.]\n</p>", "1398": "<p><b>Sadness:</b> JOY!\n</p>", "1399": "<p><i>(Joy keeps falling until she lands, tumbling down a pile of faded memories until she stops.)</i>\n</p>", "1400": "<p><b>Bing Bong:</b> Joy? \n</p>", "1401": "<p>Bing Bong notices his hand beginning to fade. He gasps. \n</p>", "1402": "<p><b>Bing Bong</b>: CONT’D) Joy! \n</p>", "1403": "<p>He finds Joy desperately clawing her way up the hill. \n</p>", "1404": "<p><b>Bing Bong:</b> (CONT’D) Joy? Joy, what are you doing? Will you stop it please? \n</p>", "1405": "<p>[Joy ignores him; keeps trying.] \n</p>", "1406": "<p><b>Bing Bong:</b>  (CONT’D) Don’t you get it, Joy? We’re stuck down here. We’re forgotten. \n</p>", "1407": "<p>[This stops Joy. All around, memories are fading to dust. Vapors blowing in the atmosphere, they disappear.] \n</p>", "1408": "<p><b>Riley</b> (O.S.) We used to play tag and stuff. \n</p>", "1409": "<p>[Joy recognizes this. She finds Sadness’ BLUE CORE MEMORY.]\n</p>", "1410": "<p><b>Riley</b> (O.S.) (CONT’D) But everything’s different now since we moved. \n</p>", "1411": "<p>[Seeing Riley cry breaks Joy’s heart. She falls to her knees. She picks up a nearby MEMORY of young happy Riley coloring.] \n</p>", "1412": "<p><b>Joy:</b> Do you remember how she used to stick her tongue out when she was coloring? \n</p>", "1413": "<p>Another memory: Riley talking to a bug. \n</p>", "1414": "<p><b>Joy:</b> (CONT’D) I could listen to her stories all day.  \n</p>", "1415": "<p>Another memory: Riley spinning. \n</p>", "1416": "<p><b>Joy:</b> (CONT'D) I just wanted Riley to be happy. And now... \n</p>", "1417": "<p>[She holds the recent blue memory of Riley in class. Joy hugs them all until the memories fall out of her arms. Joy cries. A long, deep, painful cry. Joy has lost everything. Around her, memories fade and disappear. A tear falls onto the faded TWISTY-TREE MEMORY. Joy wipes it.  In wiping the tear, the memory rewinds. Its color CHANGES from GOLD TO BLUE. IN THE MEMORY: Riley sits in the tree with her parents, the team approaching in the distance. Joy looks closer. What’s this? She rewinds more. IN THE MEMORY: Riley sits in the tree, crying, alone. Joy remembers what Sadness said about the memory...]\n</p>", "1418": "<p><b>Sadness:</b> (V.O.) It was the day the Prairie Dogs lost the big playoff game. Riley missed the winning shot. She felt awful. She wanted to quit. \n</p>", "1419": "<p>[IN THE MEMORY: Mom and Dad come to console Riley. Joy fast forwards. IN THE MEMORY: The hockey team lifts Riley on their shoulders and cheers. Riley smiles. Finally, it made sense to Joy because Sadness needs her when she needs help.] \n</p>", "1420": "<p><b>Joy</b>: Sadness. Mom and Dad, the team... they came to help because of Sadness. \n</p>", "1421": "<p>She turns to Bing Bong, ready to take action. \n</p>", "1422": "<p><b>Joy</b>: (CONT’D) We have to get back up there.\n</p>", "1423": "<p><b>Bing Bong:</b> Joy, we’re stuck down here. We might as well be on another planet.\n</p>", "1424": "<p><b>Joy:</b> (getting an idea) Another planet. (sings) Who’s your friend who likes to play?\n</p>", "1425": "<p>Silence. \n</p>", "1426": "<p><b>Joy</b>: (CONT’D) (sings louder) Who’s your friend who likes to play? \n</p>", "1427": "<p><b>Bing Bong:</b> (understanding; excited) His rocket makes you yell \"Hooray!\" \n</p>", "1428": "<p>Far off, BING BONG’S ROCKET answers. They run towards it.\n</p>", "1429": "<p><b>Bing Bong:</b> (CONT’D) Who's the best in every way and wants to sing this song to say, who's your friend who likes to play? Bing Bong Bing Bong! \n</p>", "1430": "<p>Joy and Bing Bong find the rocket! They perch the wagon atop a hill. Joy looks resigned.  \n</p>", "1431": "<p><b>Joy:</b> Hop in! \n</p>", "1432": "<p>Both inside, Bing Bong pushes off. They speed down a slope to gain momentum, singing all the way. They reach the bottom and shoot up another hill, launching up towards the cliff top. Joy and Bing Bong enthusiastically, if not desperately, sing at the top of their lungs. Not even close. They crash back to the bottom. \n</p>", "1433": "<p><b>Joy:</b> (CONT’D) C’mon! \n</p>", "1434": "<p>They shoot down a taller hill for another go. They SING faster and louder. Joy reaches for the ledge but they fall with a thud. Bing Bong stands. There’s no way they’ll make it. He looks up at the ledge and then to his hand -- it’s disappearing! \n</p>", "1435": "<p><b>Bing Bong::</b> Come on, Joy. One more time. I’ve got a feeling about this one.\n</p>", "1436": "<p>Hurdling down the largest hill yet, they continue to sing Bing Bong’s song. \n</p>", "1437": "<p><b>Bing Bong:</b> Louder! Louder, Joy! Sing louder! \n</p>", "1438": "<p>Bing Bong times it just right... and jumps out of the wagon. Without his weight, the Joy gains momentum. She’s unaware of Bing Bong’s absence. \n</p>", "1439": "<p><b>Joy:</b> We’re gonna make it! \n</p>", "1440": "<p>The rocket makes it over the ledge! It crashes atop the cliff. \n</p>", "1441": "<p><b>Joy:</b> (CONT'D) Woohoo! Bing Bong, we did it! We--\n</p>", "1442": "<p>She turns around. She’s alone. \n</p>", "1443": "<p><b>Joy</b>: (CONT'D) Bing Bong? Bing Bong! \n</p>", "1444": "<p>She runs to the cliff side. Below, Bing Bong laughs excitedly, happy to help Riley in the only way he can. \n</p>", "1445": "<p><b>Bing Bong:</b> Ya ha ha! You made it! Ha ha! Go! Go save Riley! (pause) Take her to the moon for me. Okay? \n</p>", "1446": "<p>He waves as the last of him vanishes into the air. Joy’s eyes widen in awe; he’s sacrificed his life for her. \n</p>", "1447": "<p><b>Joy:</b> I'll try, Bing Bong. I promise. \n</p>", "1448": "<p>Joy gets up and soldiers on.\n</p>", "1449": "<p>[Mom and Dad walk in.]\n</p>", "1450": "<p><b>Mrs. Andersen</b>: We’re home! Riley? Riley!\n</p>", "1451": "<p>(They check in Riley's room, but she's not here.]\n</p>", "1452": "<p><b>Mrs. Andersen:</b> I’ll call her cell.\n</p>", "1453": "<p>[Riley walks through a sketchy part of the city.]\n</p>", "1454": "<p><b>Fear</b>: This is terrible. Wait. Is that someone walking towards us? Let’s cross the street.\n</p>", "1455": "<p>[Riley’s cell phone rings. MOM is calling.]\n</p>", "1456": "<p><b>Fear:</b> It's Mom! She's on to us! Where's my bag?\n</p>", "1457": "<p>[Fear finds a paper bag and breathes into it to calm himself.]\n</p>", "1458": "<p><b>Disgust</b>: What do we do?\n</p>", "1459": "<p><b>Anger:</b> Riley needs to get core memories. We keep going.\n</p>", "1460": "<p>[Riley ignores the call and walks on.]\n</p>", "1461": "<p>Joy runs through the Long-Term Memory stacks.\n</p>", "1462": "<p><b>Joy:</b> Sadness!\n</p>", "1463": "<p>[She sees Family Island rumble, pieces beginning to break off. She frantically continues on. Joy runs through a long corridor.]\n</p>", "1464": "<p><b>Joy:</b> Sadness? Sadness? (no answer; desperate) C’mon Sadness, where are you? Okay. If I were Sadness, where would I be?\n</p>", "1465": "<p>[Joy slumps to the ground. She kicks a leg up in the air.]\n</p>", "1466": "<p><b>Joy:</b>  (Sadness voice) Ohhh... everything is awful and my legs don’t work and you have to drag me around while I touch all the--\n</p>", "1467": "<p>[Joy stops. Something has caught her eye. REVEAL: a path of blue memories on the bottom shelves. Joy follows the path. Riley walks out of the bus depot and into the advancing line. Her cell phone rings again.]\n</p>", "1468": "<p><b>Disgust:</b> Oh no. It’s Mom again. What do we do?!\n</p>", "1469": "<p><b>Anger</b>: Uh... Uh...\n</p>", "1470": "<p>[Boom! Family Island rumbles behind them. Riley ignores the call once more, causing the island to break into pieces once more,]\n</p>", "1471": "<p><b>Anger</b>: This is madness! She shouldn’t run away!\n</p>", "1472": "<p><b>Disgust:</b> Let’s get this idea out of her head.\n</p>", "1473": "<p>They rush to unplug the idea.\n</p>", "1474": "<p>Joy runs, following the path of blue memories.\n</p>", "1475": "<p><b>Joy:</b> Sadness! \n</p>", "1476": "<p>[Joy rounds a corner and spots Sadness far down the next row.]\n</p>", "1477": "<p><b>Joy:</b> Sadness!\n</p>", "1478": "<p>[Sadness turns around.]\n</p>", "1479": "<p><b>Sadness:</b> Joy?\n</p>", "1480": "<p>[Inexplicably, Sadness turns and runs away.]\n</p>", "1481": "<p><b>Joy</b> Wait, Sadness! [chases after her.]\n</p>", "1482": "<p><b>Sadness:</b> Just let me go! Riley’s better off without me!\n</p>", "1483": "<p>[Joy follows Sadness straight into Imagination land. Sadness topples giant french fries in Joy’s path.]\n</p>", "1484": "<p><b>Joy:</b> Come back!\n</p>", "1485": "<p>[Joy uses a super-long fry to vault over the mound of fries. In Cloud Town, two MIND WORKER COPS are questioning a CLOUD WITNESS.]\n</p>", "1486": "<p><b>Cop #1</b> So you’re saying your husband was blown away by an elephant.\n</p>", "1487": "<p>[The Cloud Witness nods. Sadness runs past the crime scene. They don’t notice.]\n</p>", "1488": "<p><b>Cop #1</b> (CONT’D) Was he with anyone?\n</p>", "1489": "<p><b>Cloud Witness:</b> Yes! And there she is!\n</p>", "1490": "<p>[Joy runs right through the Cloud Witness, dissipating her.]\n</p>", "1491": "<p><b>Cop #1</b> (runs after Joy) Hey! Come back here!\n</p>", "1492": "<p><b>Cop #2:</b> Forget it, Jake. It’s Cloud Town.\n</p>", "1493": "<p>[Joy searches for Sadness. Suddenly, rain falls on her. Above, Sadness is floating on a chunk of rain cloud, away from Headquarters.]\n</p>", "1494": "<p><b>Joy:</b> What? Sadness!\n</p>", "1495": "<p><b>Sadness:</b> (crying) I only make everything worse!\n</p>", "1496": "<p><b>Joy:</b> Wait, Sadness! We've gotta get you back to... (Sadness is too far away) Ugh.\n</p>", "1497": "<p>[Joy looks back at Family Island crumbling. She looks around: what does she have to work with? The Boyfriend Generator...]\n</p>", "1498": "<p>[Anger tries to untwist the Idea Bulb, but IT WON’T MOVE.]\n</p>", "1499": "<p><b>Anger</b>: It’s stuck!\n</p>", "1500": "<p><b>Disgust:</b> Oh great.\n</p>", "1501": "<p><b>Fear:</b> What do you mean it’s stuck?!\n</p>", "1502": "<p><b>Disgust:</b> Now what?\n</p>", "1503": "<p>[A strange BLACKNESS spreads over the console.]\n</p>", "1504": "<p><b>Fear:</b> Oh, no, no, no. What is THIS?!\n</p>", "1505": "<p>[Anger slams a chair down on the console. It bounces off with no effect. Fear lunges in with a crowbar. He loses control and it smacks him in the face. Riley walks down the aisle of the bus to take a seat.]\n</p>", "1506": "<p><b>Fear:</b> Oh, how do we stop it?\n</p>", "1507": "<p><b>Disgust:</b> I got it! Make her feel scared! That’ll make her change her mind!\n</p>", "1508": "<p><b>Fear:</b> Brilliant!\n</p>", "1509": "<p><b>Disgust:</b> I know it’s brilliant. Do it!\n</p>", "1510": "<p>[Fear frantically pushes buttons.]\n</p>", "1511": "<p><b>Fear:</b> Ahh! Nothing’s working! Why isn’t it working??\n</p>", "1512": "<p><b>Anger:</b> Let me try!\n</p>", "1513": "<p>Disgust and Fear pound on the console buttons.\n</p>", "1514": "<p><b>Disgust:</b> Great, you broke it!\n</p>", "1515": "<p><b>Fear:</b> No, I didn’t!\n</p>", "1516": "<p><b>Anger:</b> Let me do it!\n</p>", "1517": "<p>[By now, the console is mostly black. No matter how many times they tried, they kept fighting. Fear stops.]\n</p>", "1518": "<p><b>Fear:</b> Guys..... we can’t make Riley feel anything.\n</p>", "1519": "<p><b>Anger:</b> What have we done?\n</p>", "1520": "<p>[Joy runs up to Riley’s Imaginary Boyfriend.]\n</p>", "1521": "<p><b>Joy:</b> Hey! Hey, look at me. Did you mean what you said before?\n</p>", "1522": "<p><b>Imaginary boyfriend</b>:  I would die for Riley! I would die for Riley!\n</p>", "1523": "<p><b>Joy:</b> Yeah, yeah, okay, Haircut. Time to prove it.\n</p>", "1524": "<p>[Joy scoops him into her satchel. She activates the generator. Imaginary Boyfriends pour out, directly into Joy’s satchel. Joy spots Sadness ahead, and runs past her. She pulls a balloon free from a TWISTY BALLOON PALM TREE. She aims it towards the approaching Sadness and unties it. PTHHPT! The balloon blows Sadness back over the MEMORY DUMP. In the process, the HOUSE OF CARDS behind them collapses.]\n</p>", "1525": "<p><b>Worker;</b> (angry) That’s it! I fold!\n</p>", "1526": "<p>[Joy sprints by grabbing the SATCHEL, now full of boyfriends. Sadness floats out over the Memory Dump. Joy runs along the cliff edge, parallel to Sadness, towards Family Island. Joy sights Sadness and aligns herself with Family Island. She dumps the satchel, pouring out the Boyfriends. Their momentum pulls her to the top of a TOWER OF BOYFRIENDS.]\n</p>", "1527": "<p><b>Joy:</b> (to herself) This is crazy, this is crazy... No, no, no! Joy! Be positive. (beat) I am POSITIVE this is crazy! I\n</p>", "1528": "<p>Joy spots the trampoline on Family Island, then Sadness floating away. She times it...\n</p>", "1529": "<p><b>Joy:</b> (CONT’D) NOW!\n</p>", "1530": "<p>The tower tips forward.\n</p>", "1531": "<p><b>Imaginary boyfriends</b>: FOR RILEY!!!\n</p>", "1532": "<p>[Joy falls towards Family Island, bounces on the TRAMPOLINE, flying up towards Sadness. She intercepts Sadness midair...]\n</p>", "1533": "<p><b>Sadness:</b> Joy?\n</p>", "1534": "<p><b>Joy:</b> Hang on!\n</p>", "1535": "<p>[They launch towards Headquarters. Will they make it? Anger, Fear and Disgust watch the screen, worried.]\n</p>", "1536": "<p><b>Fear:</b> Ohhh, I wish Joy was here!\n</p>", "1537": "<p>[SPLAT! Joy and Sadness hit the back window and slide down, grabbing the window edge. The Emotions run to the window.]\n</p>", "1538": "<p><b>Disgust:</b> It’s Joy!\n</p>", "1539": "<p><b>Anger</b>: Stand back! Arrrrgh!\n</p>", "1540": "<p>[Anger throws a chair at the window. It bounces off.]\n</p>", "1541": "<p><b>Disgust:</b> (sarcastically) That worked.\n</p>", "1542": "<p><b>Anger:</b> Well, what would you do, if you’re so smart?!\n</p>", "1543": "<p><i>(Anger's head is igniting; this gives Disgust an idea.)</i>\n</p>", "1544": "<p><b>Disgust:</b> I'd tell you, but you're too dumb to understand.\n</p>", "1545": "<p><b>Anger:</b> WHAT!?!\n</p>", "1546": "<p><b>Disgust:</b> Of course, your tiny brain is confused. Guess I'll just have to dumb it down to your level. Sorry I don't speak moron as well as you. But let me try. Duhhhhhh!\n</p>", "1547": "<p><i>(And what a yell and fire it is. Disgust puts on a welding mask and aims Anger at the window, breaking a hole in the glass. Once Anger has calmed down, Disgust and Fear help Joy and Sadness inside safely.)</i>\n</p>", "1548": "<p><b>Fear:</b> Oh, thank goodness you're back!\n</p>", "1549": "<p><b>Disgust:</b> Things are really messed up.\n</p>", "1550": "<p><b>Anger:</b> We found this idea and now Riley’s on a bus heading for Minnesota!\n</p>", "1551": "<p><b>Fear:</b> We were trying to make happy memories!\n</p>", "1552": "<p><i>(On the screen, Riley stares out the bus window. The bus is pulling out; nearby the depot is the highway leading to Bay Bridge, which leads out of San Francisco with no turning back.)</i>\n</p>", "1553": "<p><b>Disgust:</b> Joy, you got to fix this. Get out there.\n</p>", "1554": "<p><b>Joy:</b> Sadness, it's up to you.\n</p>", "1555": "<p><b>Sadness:</b> Me?\n</p>", "1556": "<p><b>All:</b> Sadness?!\n</p>", "1557": "<p><b>Sadness:</b> I can't, Joy.\n</p>", "1558": "<p><b>Joy:</b> Yes you can. Riley needs you.\n</p>", "1559": "<p><i>(Sadness is surprised; Joy nods in affirmation The bus is exiting the parking lot; Realizing her true purpose, Sadness walks over to the console. The console is almost completely black.)</i>\n</p>", "1560": "<p><b>Sadness:</b> Okay...\n</p>", "1561": "<p><i>(Resisting a bit, she puts her hands on the bulb; the other emotions watch with worry and anticipation. All of the controls stop working and the console is completely black now. The bus pulls out onto the road into the direction of the highway. Sadness then does her thing and twists the bulb, successfully unscrewing it and turning it off. The console's blackness retracts, reactivating the controls, and the bulb rises and pops out.)</i>\n</p>", "1562": "<p><i>(Outside, feeling comes back to Riley as she realizes what she is doing. She gets out of her seat.)</i>\n</p>", "1563": "<p><b>Riley:</b> Wait, stop! I wanna get off!\n</p>", "1564": "<p><i>(The bus stops just before the highway entrance and Riley jumps off and runs away. Joy and the emotions are surprised; Riley continues running down the sidewalk back home.)</i>\n</p>", "1565": "<p><b>Mrs. Andersen:</b> Alright, thank you, we will. Her teacher hasn't even seen Riley all day!\n</p>", "1566": "<p><b>Mr. Andersen</b>: What? I can't believe this.\n</p>", "1567": "<p><b>Mrs. Andersen:</b> What was she wearing last? Do you even remember what--\n</p>", "1568": "<p>[The door opens. Riley walks in. They rush over to her.]\n</p>", "1569": "<p><b>Mrs. Andersen:</b> Riley!\n</p>", "1570": "<p><b>Mr. Andersen:</b> Riley, there you are! Thank goodness!\n</p>", "1571": "<p><b>Mrs. Andersen:</b> Oh, we were worried sick! Where have you been? It’s so late...\n</p>", "1572": "<p>(Riley, what happened? Are you alright?)\n</p>", "1573": "<p><i>(In Headquarters, Joy decides it's time for Sadness to do her stuff. Without hesitation, she gives her the Core Memories, Sadness scoops them up, and they all turn blue. One by one, Sadness places each memory in the recall unit. Then, she placed her hand on the console. It turns BLUE. For the first time, Riiley cries.]</i>\n</p>", "1574": "<p><b>Riley:</b> I know you don't want me to, but, I miss home. I miss Minnesota. You need me to be happy. But, I want my old friends and hockey team. I wanna go home. Please don't be mad.\n</p>", "1575": "<p><b>Mrs. Andersen</b>: Oh, sweetie.\n</p>", "1576": "<p><b>Mr. Andersen:</b> We're not mad. You know what? I miss Minnesota, too. I miss the woods where we took hikes.\n</p>", "1577": "<p><b>Mrs. Andersen</b>: And the backyard where you used to play.\n</p>", "1578": "<p><b>Mr. Andersen:</b> Spring Lake, where you learned to skate. Come here.\n</p>", "1579": "<p><i>(Riley embraces her parents in a tearful hug; in Headquarters, Joy presents one last present for Sadness: The sad Core Memory. But Sadness has an even better idea -- she brings Joy over to the console, and they press a button together, making it glow both yellow and blue. This causes Riley, while still letting it out, to smile slightly.)</i>\n</p>", "1580": "<p><i>(Joy and Sadness watch; a ding is heard as from behind the screen, a new Core Memory comes out, never before seen: it is half yellow, half blue. It sinks into the floor and rolls to the Core Memory pedestal, shooting out a beam of light to the mind world, creating a brand new Family Island outside. It resembles the original one, but with various San Francisco landmarks such as the Golden Gate Bridge.)</i>\n</p>", "1581": "<p><i>(The Emotions are astounded at this new mixed emotion Core Memory; as the Andersen family continues to embrace each other, Joy and Sadness observe, side by side. They are now a team.)</i>\n</p>", "1582": "<p><i>(It is now been a whole year since the move; among the Core Memory of the Andersens' tearful embrace, new core memories of two different emotions surround them. Outside Headquarters, the original islands have been restored, with the addition of some new ones reflecting that Riley has matured.)</i>\n</p>", "1583": "<p><b>Fear:</b> Hey, I'm liking this new view.\n</p>", "1584": "<p><b>Anger:</b> Friendship Island has expanded. Glad they finally opened that Friendly Arguments section.\n</p>", "1585": "<p><b>Sadness:</b> I like Tragic Vampire Romance Island.\n</p>", "1586": "<p><b>Disgust:</b> Fashion Island. Everyone shut up!\n</p>", "1587": "<p><b>Fear</b>: Boy Band Island. Hope that's just a phase.\n</p>", "1588": "<p><b>Joy:</b> Say what you want, I think it’s all beautiful.\n</p>", "1589": "<p>WORKER FRITZ: Alright!\n</p>", "1590": "<p>The Emotions turn to see workers at a new, larger console.\n</p>", "1591": "<p>WORKER FRITZ: (CONT’D) There you go. Your new expanded console is up and running.\n</p>", "1592": "<p>The new console lights up.\n</p>", "1593": "<p><b>Emotions</b>: Whoa!\n</p>", "1594": "<p><b>Disgust</b>:  Cool. Upgrade!\n</p>", "1595": "<p><b>Joy</b>: Ooohh.\n</p>", "1596": "<p>Fear leans on the console. BEEP!\n</p>", "1597": "<p><b>Fear</b>: Hey! Whoa! Whoops, wait. Did I just do that?\n</p>", "1598": "<p><b>Disgust</b>: (re: a warning light label) Hey guys? What’s “pub-er-ty?”\n</p>", "1599": "<p><b>Joy</b>: I don’t know. It’s probably not important.\n</p>", "1600": "<p><b>Anger</b>: Whoa. I have access to the entire Curse Word Library! This new console is the sh--\n</p>", "1601": "<p>BEEP!\n</p>", "1602": "<p><b>Fear</b>: Sorry. I did it again. My bad.\n</p>", "1603": "<p><b>Disgust</b>: (pointing to screen) They’re getting to the rink!\n</p>", "1604": "<p><b>Mr Anderson:</b> Now when you get out there, you be aggressive!\n</p>", "1605": "<p>Riley: (embarrassed) I know, Dad.\n</p>", "1606": "<p>MOM -- but not too aggressive.\n</p>", "1607": "<p>RILEY You know, you guys don’t have to come to every game.\n</p>", "1608": "<p>Mom and Dad’s faces are painted blue and green.\n</p>", "1609": "<p>DAD Are you kidding? I’m not missing one! GO FOGHORNS!\n</p>", "1610": "<p>MOM GO RILEY! FOGHORNS ARE THE BEST!\n</p>", "1611": "<p>RILEY Okay, okay. I gotta go.\n</p>", "1612": "<p>Riley walks away, mortified, as Dad makes foghorn noises.\n</p>", "1613": "<p><b>Joy</b>:  Awww...\n</p>", "1614": "<p><b>Fear</b>: They love us!\n</p>", "1615": "<p><b>Anger</b>: Yeah, Mom and Dad are pretty cool.\n</p>", "1616": "<p><b>Disgust</b>: Guys, of course they are. But we can’t SHOW IT! \n</p>", "1617": "<p>Zoom in to Dad’s head... Dad’s Emotions cheer. They all have their faces painted. ON THE SCREEN: Mom beams at Dad.\n</p>", "1618": "<p>DAD’S FEAR She loved the face painting!\n</p>", "1619": "<p>DAD’S ANGER Ha! Told you it was a great idea!\n</p>", "1620": "<p>Dad turns to Mom. She smiles, and we zoom in to her head... All Mom’s Emotions are also painted.\n</p>", "1621": "<p>MOM’S ANGER Best idea he’s had in awhile.\n</p>", "1622": "<p>MOM’S SADNESS He’s a really good guy.\n</p>", "1623": "<p>They all sigh. Mom’s Anger tosses the MEMORY of the Brazilian helicopter pilot. Mom’s Fear retrieves it.\n</p>", "1624": "<p>MOM’S FEAR Just in case.\n</p>", "1625": "<p>Riley walks towards the ice and bumps into A TEEN BOY. He drops his water bottle. She picks it up for him.\n</p>", "1626": "<p><b>Riley</b>: Oh. Sorry!\n</p>", "1627": "<p>She smiles. In the boy's mind, his Emotions run around in a panic, screaming while a warning sign flashed. One of them is HUDDLED, crying. Outside, the boy stands stunned, unable to speak. Riley hands him the water bottle.\n</p>", "1628": "<p><b>Riley:</b> Uhh... Ooooo-kay. Bye!\n</p>", "1629": "<p>Riley skates out onto the ice, looking back over her shoulder... with a hint of a smile?\n</p>", "1630": "<p>HOCKEY TEAMMATE (O.S.) All set, Riley?\n</p>", "1631": "<p>She HIGH-FIVES a new teammate. They skate into position as Mom and Dad cheer from the stands.\n</p>", "1632": "<p>Joy and Sadness stand side by side at the new console, flanked by the others.\n</p>", "1633": "<p><b>Joy:</b> You ready?\n</p>", "1634": "<p><b>Sadness:</b> Yeah!\n</p>", "1635": "<p><b>Joy:</b> Alright. Let’s play some hockey!\n</p>", "1636": "<p>Riley faces off. The puck drops.\n</p>", "1637": "<p><b>Joy:</b> (O.S.) All right Anger, take it!\n</p>", "1638": "<p><b>Anger</b>: (O.S.) Give us that puck or you’re dead meat! Riley gets it!\n</p>", "1639": "<p><b>Fear:</b> (O.S.) On our left! On our left!\n</p>", "1640": "<p>An opponent steals the puck.\n</p>", "1641": "<p><b>Disgust:</b> (O.S.) Let’s just try not to get all smelly this time.\n</p>", "1642": "<p><b>Sadness</b>: (O.S.) Hooh, Mom and Dad are watching us fail.\n</p>", "1643": "<p><b>Anger</b>: (O.S.) Not today!\n</p>", "1644": "<p>Riley regains the puck and skates off with a smile.\n</p>", "1645": "<p><b>Joy</b>: (V.O.) We’ve been through a lot lately, that’s for sure. But we still love our girl. She has great new friends, a great new house... things couldn’t be better! After all, Riley’s 12 now. What could happen?\n</p>"}